{
  "name": "Magical Flowers",
  "description": "Hi there Bandit. I\u0027m Occult Botonist Belle, lead researcher of uh...lets just say unique plants. Apparently when you crossbreed and genetically modify plants to make synthetic meat and bodyparts, or make them start walking around demanding to be fed blood, you\u0027re suddenly....nevermind! Not important! What IS important is you\u0027ve found some very very interesting plants! Working together, I bet we can make a LOT of interesting discoveries!",
  "quests": [
    {
      "name": "Botania - Magical Flowers!",
      "description": "Okay, the few flowers that Biologist Bitsy sent me were very interesting! I see there are about 16 different species scattered about... Could you send me, say, five of any of them? They should glow very slightly, hard to miss!                There also seems to be a tall variety of them, but are a bit more fragile. Use Shears on those to collect them!",
      "x": 37,
      "y": 159,
      "icon": {
        "id": "ferretshinies:IconAsset"
      },
      "prerequisites": [
        "{Initial Research}[Shiny Flowers?]"
      ],
      "tasks": [
        {
          "type": "CONSUME",
          "description": "A Beautiful Bouquet",
          "longDescription": "    They seem to like to grow in bunches. Be sure to gather as many as you can, we can figure out how to grow them ourselves later.",
          "items": [
            {
              "item": {
                "id": "Botania:flower"
              },
              "required": 5,
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 5
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "Botania:lexicon"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Crush a bit...",
      "description": "These flowers are gorgeous! They\u0027ve caught the eye of a few assistants...and of the CEO. He\u0027s requisitioned a lab and greenhouse for my newly formed team. We\u0027ve been researching, and I just sent you a modified version of the \"Book Model\" of the QUEST Tablet called the Lexica Botania. It\u0027s connected to our systems here, and we can share research with each other this way! Why Botania? Thats the name of this new corporate position! Botaniason Belle, thats me! The book will explain a lot more, so lets get started...",
      "x": 59,
      "y": 187,
      "icon": {
        "id": "Botania:petal",
        "damage": 14
      },
      "prerequisites": [
        "Botania - Magical Flowers!"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Lets examine the petals...",
          "longDescription": "    Craft a couple flowers to get their petals. Any color will do, really.                                           You can Right Click a petal on the ground to \u0027bury\u0027 it, and it will make the ground shimmer in that color a bit. If you use some Bone Meal on this, it will grow into a Double Flower! This is great for multiplying colors you already have.",
          "items": [
            {
              "item": {
                "id": "Botania:petal",
                "damage": 14
              },
              "required": 4,
              "precision": "FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Make some powder...",
          "longDescription": "    Combining a Pestle and Mortar with a petal will grind it down into powder. A lot of these powders also double as Dyes!",
          "items": [
            {
              "item": {
                "id": "Botania:pestleAndMortar"
              }
            },
            {
              "item": {
                "id": "Botania:dye",
                "damage": 13
              },
              "required": 4,
              "precision": "FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "And mix in some bonemeal!",
          "longDescription": "    Mix two petals worth of powder and some ground bones together.       You can use this in a grassy area like you would Bonemeal, and it will grow a handful of Mystical Flowers for you!                           ",
          "items": [
            {
              "item": {
                "id": "Botania:fertilizer"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 5
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Botaniason Tools 1",
      "description": "    Now that we can grow more Flowers (unreliably, but still!), we can more earnestly begin to research them. Just in our initial tests, the Flowers are amazing in of themselves, but we were quick to discover just how magical they were! One of the assistants was using a large Stone bowl full of warm water to see if he could infuse the water with Magic. He says he got lost just watching the Petals swirling around (I admit, it IS quite calming!). He was so lost to it, he took out a snack of some roasted Seeds (Quite the OSHA violation I have to say...) and accidently dropped some into the bowl.                                            Suddenly the Water, the Petals, and the Seeds vanished in a puff of magic, and the assistant found a strange, new Flower in his hand! He quickly planted it to observe it, and noticed it had a strange effect on the Logs and Stones around it...",
      "x": 62,
      "y": 160,
      "icon": {
        "id": "Botania:altar"
      },
      "prerequisites": [
        "Crush a bit..."
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Pretty Pretty Apothecary",
          "longDescription": "    The Petal Apothecary is the best way to use this new magical ability. You can fill it by Right Clicking a Bucket of Water onto it, or dropping the item itself on top.         You then toss the petals or other items (hold them in your hand and press Q to throw). When looking at the Apothecary, it will show you what components are swirling around, and if they make anything. Quite handy!                                     An even handier thing : If you refill the Apothecary with Water and Right Click with an Empty Hand within 20 seconds, you\u0027ll readd the same ingredients you used to create the last Flower (if they are in your inventory that is!). Super useful for crafting a lot of Flowers in a row!",
          "items": [
            {
              "item": {
                "id": "Botania:altar"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Calmly Swirling Round...",
          "longDescription": "    Toss four Mystical White Petals into the Apothecary. Then toss a Seed into the Apothecary, and out will pop a new Flower!                       If you are having a tough time finding regular Seeds, you can transform almost any seed into one by combining it with some Floral Powder.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"puredaisy\"}"
              }
            }
          ]
        },
        {
          "type": "CONSUME",
          "description": "Logs and Stone Reaction?",
          "longDescription": "    Place the Pure Daisy on a bit of Dirt or Grass, and surrounded it with either Stone or Logs. After a bit, the Pure Daisy will transform them into something new!                    Could you send me some samples of both? ",
          "items": [
            {
              "item": {
                "id": "Botania:livingrock"
              },
              "required": 4
            },
            {
              "item": {
                "id": "Botania:livingwood"
              },
              "required": 4
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A little whittling...",
          "longDescription": "    The Living Wood and Stone seem to be infused with some sort of energy, so lets try making something with it...",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 3
              },
              "required": 3
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "...and some pretty petals.",
          "longDescription": "    The color of the petals you craft the wand with will change the actual wand colors. The Wand has two modes : Function and Bind, and you can swap between them by Sneak + Right Clicking.",
          "items": [
            {
              "item": {
                "id": "Botania:twigWand",
                "nbt": "{color1:10,color2:10,boundTileZ:0,boundTileX:0,boundTileY:-1}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Pocket Flowers",
          "longDescription": "If you are finding your pockets a bit full with Mystical Flowers, you can craft this Flower Pouch to hold them!",
          "items": [
            {
              "item": {
                "id": "Botania:flowerBag",
                "nbt": "{InvItems:[]}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 5
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Botaniason Tools 2",
      "description": "With some of the things we\u0027ve discovered about Mana and utilizing it, I think we can easily improve on a few tools so far and start researching more things. I highly suggest making more of those Endoflame flowers, as I get the feeling we\u0027ll be using a LOT more Mana as we research more things...",
      "x": 90,
      "y": 142,
      "icon": {
        "id": "Botania:manaInkwell",
        "damage": 150
      },
      "prerequisites": [
        "Energy Control"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Controlled Bursts",
          "longDescription": "This version of the Mana Spreader will only send Mana when it has a Redstone signal.",
          "items": [
            {
              "item": {
                "id": "Botania:spreader",
                "damage": 1
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Magical Ink",
          "longDescription": "The Thaumaturgic branch have been working alongside us, and we\u0027ve worked out a way to imbue their Scribing Tools with Mana, so that they can refill it in a Mana Pool instead of with Ink Sacs, which we feel is much more Magical.",
          "items": [
            {
              "item": {
                "id": "Botania:manaInkwell",
                "damage": 150
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Hot Guest",
          "longDescription": "    Something we\u0027ve found in our studies of this new Mana is an odd thing. Well, one of the Assistants is a bit infatuated with Halloween (which is forever away, you know!) and was making some spooky things with some of the materials we\u0027ve been testing here...                          Well, he took a Pumpkin that had been filled with some Bone, some Rotten Flesh, a bit of Gunpowder, and hung it from a String atop a pole made of Iron Bars, and suddenly the Mana burst it to life in the form of a floating, burning creature that spat fireballs at us!         According to the other Branches here that have been studying your data, it\u0027s apparently called a Blaze? Well, the Mana that infused it seems to make it drop a lot of Blaze Powder, instead of the reported Blaze Drops... perhaps this will be useful to you?",
          "items": [
            {
              "item": {
                "id": "Botania:felPumpkin"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 5
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Sun and Moon Flowers",
      "description": "    So....we\u0027ve been testing the Petal Apothecary a bit more after that \u0027sunflower seed\u0027 incident / breakthrough. What kind of seeds can be the catalyst are a bit confusing, but we\u0027ve found that the Floral Powder can be combined with almost any seed to transform it into a basic Seed.                            We\u0027ve found two new flowers that seem to generate that \"Energy\" we mentioned before. Coincidently, the two seem to be opposites of each other as well! They only live for a few days after being planted, though, but I don\u0027t doubt we can find more hearty flowers than these two. Its a good start though!",
      "x": 88,
      "y": 173,
      "icon": {
        "id": "Botania:specialFlower",
        "nbt": "{type:\"daybloom\"}"
      },
      "prerequisites": [
        "Botaniason Tools 1"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "A Sunny Disposition",
          "longDescription": "    This Flower creates Mana during the day, as long as it can see the sky!",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"daybloom\"}"
              },
              "required": 2
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "In Darkest Night...",
          "longDescription": "    This Flower generates Mana during the night, as long as it can see the star-filled sky!",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"nightshade\"}"
              },
              "required": 2
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 5
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 5
        }
      ]
    },
    {
      "name": "Energy Control",
      "description": "    Very interesting! Those Day Blooms and Nightshades really go to town! Our scanners show that \u0027energy\u0027 builds nicely during over the course of the day. You know, it really needs a better name...well, lets call it Mana since this is still technically an \u0027occult\u0027 wing of The Business.                                     We should find a way to collect and harness this Mana, and I think making a large vessel of Living Stone and some tools from the Living Wood should work. We can also shape these materials and turn them into something to help us utilize this Mana.",
      "x": 62,
      "y": 131,
      "icon": {
        "id": "Botania:pool",
        "damage": 2
      },
      "prerequisites": [
        "Sun and Moon Flowers"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Fairly light...for stone.",
          "longDescription": "    This looks good, and should hold a good amount of Mana. ",
          "items": [
            {
              "item": {
                "id": "Botania:pool"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Kind of like a Solar Oven?",
          "longDescription": "When a Mana Spreader has enough Mana, it will \u0027fire\u0027 it out where it is aiming. We call this a Mana Burst. You can select a Mana Spreader by holding your Wand of the Forest and Sneak + Right Clicking on it while in Bind mode. It will have a rainbow box around it. You can then target where it\u0027s aiming with Sneak + Right Clicking the target. Mana Pools cannot gather Mana themselves, you\u0027ll need to use a Spreader to transfer Mana from the flowers to one. You can also Right Click any Wool onto the Mana Spreader to both decorate it and muffle the shooting sound.",
          "items": [
            {
              "item": {
                "id": "Botania:spreader"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Kiddie Pool",
          "longDescription": "    The normal Mana Pool is quite useful, but I think we can make a slightly smaller one in capacity. It\u0027d be quite helpful in determining how much Mana we\u0027re generating over time, for example.                            Oh, a fun thing we found out! If you Right Click any color of Floral Powder into the Mana Pool, it will dye it that color!",
          "items": [
            {
              "item": {
                "id": "Botania:pool",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Powder Power",
          "longDescription": "    Now that we have some Mana and a place to store it, we can see what happens when we dip various items into it.                                          First thought to us was try a bit of Redstone, which is slightly Magical in its own way, and we ended up with this interesting, blue version we\u0027re calling Mana Powder!",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 23
              },
              "required": 2,
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Petals of Flame",
          "longDescription": "    This Mana Powder gives us even more to work with in finding new flowers, like this Endoflame! It burns solid fuel like Coal dropped near it to generate a Mana much faster than the Dayblooms and Nightshades!",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"endoflame\"}"
              },
              "required": 2
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 5
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Mana Infusion",
      "description": "Interesting! If you hold your Living Wand, you can even see the energy flowing from the Mana Spreaders, and it seems to even control how things rotate. I have one of my assistants practicing with his wand, and I\u0027m updating the Lexica Botania with more instructions as we speak. Since dipping a Mana Pool and Mana Petals into Mana has netted us progress, we\u0027ll just start tossing everything but the kitchen sink into this Mana Pool! We\u0027ll be sure to add more things we discover to the Lexica Botania as we find them.",
      "x": 116,
      "y": 127,
      "icon": {
        "id": "Botania:manaResource"
      },
      "prerequisites": [
        "Botaniason Tools 2"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Magic Materials!",
          "longDescription": "    Managlass can be turned into Panes, while Manasteel can be formed into Blocks for easier storage.",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource"
              }
            },
            {
              "item": {
                "id": "Botania:manaGlass"
              }
            },
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 16
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "And Pretty Gemstones!",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 2
              }
            },
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 1
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Magical Wardrobe",
          "longDescription": "    Looking at all our research, we\u0027re going to be using more and more Mana in the tools we make. Plus, we don\u0027t quite look the magical part, no? I mean, we\u0027re working with Mana and stuff...                             So, enter the Manaweave Cloth. By combining Mana Infused String to create Cloth, you can then form the Cloth into various pieces of Manaweave Clothing.                         By wearing an entire set of Manaweave Clothing, all tools and devices you use that require Mana will take a good bit less! That means you can use them for much longer, and to boot you look quite fetching!      Since it might take a good bit for you to gather enough Mana and String, I\u0027ll only ask you to make the Robe Top.",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 22
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:manaweaveChest"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Manipulation of Mana",
      "description": "It takes more time than we really care for to examine how each new flower we discover works, how much power its generating, etc. We\u0027ve worked in a bit of older technology into our research, the Redstone Dust technology. With it, we\u0027ve been able to create devices that let us detect, spread, and remove Mana from what we are calling a Mana Network. During this research, we\u0027ve also discovered a new Flower that will detect if your Mana Network is either gaining or losing Mana. ",
      "x": 137,
      "y": 155,
      "icon": {
        "id": "Botania:manaDetector"
      },
      "prerequisites": [
        "Mana Infusion"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "One...two...three....four...",
          "longDescription": "When a Mana Burst travels through this device, it will emit a Redstone signal.",
          "items": [
            {
              "item": {
                "id": "Botania:manaDetector"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Sharing the Joy",
          "longDescription": "The Distributor only spreads the mana to pools that are touching it. Make sure not to accidently block the Mana Bursts with one of the pools!",
          "items": [
            {
              "item": {
                "id": "Botania:distributor"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Gone, Gone Forever",
          "longDescription": "Any Mana Burst that hits this device is destroyed. Completely. Never existed!",
          "items": [
            {
              "item": {
                "id": "Botania:manaVoid"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "What if it blinks, though?",
          "longDescription": "When this Flower is Blue, it means the Mana Network it is on is gaining Mana. If it is Red, well, better find what\u0027s draining your Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"manastar\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Oho, Chap!",
          "longDescription": "When worn in your Amulet slot, this Monocle allows you to see Mana Bursts, even if something else is in the way.",
          "items": [
            {
              "item": {
                "id": "Botania:monocle"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Choo Choo",
          "longDescription": "Need to transport your Mana long distances? Well, put it on a Minecart! You can combine a Mana Pool and Minecart, and then pump Mana ino it with a Mana Pump. Mana is pulled from the Blue side of the pump and put into the Pink side of the pump. You cannot fill or empty Mana from a Mana Minecart any other way.",
          "items": [
            {
              "item": {
                "id": "Botania:poolMinecart"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:pump"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "A Signal to Noise",
      "description": "We\u0027ve been combining various Petals and items in different ways to see what we come up with. At first, we created a pretty yet useless cube that seemed to be somewhat Unstable. We continued researching it, and by surrounding an eye Pearl from one of those really creepy Endermen in these to create a Signaling device that is moderately more useful. This gave one of my assistants a brilliant (or slightly crazy...) idea of turning that into a gun! Well, more specifically, a Signal Flare that not only acts like its name, it ALSO seems to emit some supersonic sounds we can\u0027t hear that incapacitates Monsters around you temporarily!",
      "x": 97,
      "y": 100,
      "icon": {
        "id": "Botania:signalFlare",
        "nbt": "{color:10}"
      },
      "prerequisites": [
        "Mana Infusion"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Can You Guess My Fav Color?",
          "items": [
            {
              "item": {
                "id": "Botania:unstableBlock",
                "damage": 10
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Marking With Fireworks",
          "longDescription": "You can stop the constant fireworks display by sending a Redstone Signal to this device.",
          "items": [
            {
              "item": {
                "id": "Botania:manaBeacon",
                "damage": 10
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Look Here!",
          "items": [
            {
              "item": {
                "id": "Botania:signalFlare",
                "nbt": "{color:10}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "The Lyre\u0027s Instrument",
          "longDescription": "    Speaking of noise, one of the assistants got back from some sportsball event sporting some sort of long horn noise maker. It was loud and annoying, but it gave us an idea!                                   The Cacophonium can mimic any creature\u0027s natural sounds and play them back. Just Right Click it onto any creature, then hold Right Click to play it back.                        You can also Right Click the Cacophonium onto a Note Block to turn it into a Cacophonium Block, which you can activate like a normal Note Block.",
          "items": [
            {
              "item": {
                "id": "Botania:cacophonium"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 15
        }
      ]
    },
    {
      "name": "Teacher to Student",
      "description": "    Since we\u0027re dealing with Magic here, we\u0027ve been in contact with some of the Magical branches of The Ferret Business. They\u0027ve given us some excellent ideas on what we can do. One of them is to alter our Mana Pool into a sort of Alchemical cauldron.                                      Another would be to break down common items into their very essence and form Runes of concentrated power. We\u0027re still testing the extents of these additions to our Mana Network, and will update the Lexica Botania with our findings!",
      "x": 163,
      "y": 98,
      "icon": {
        "id": "Botania:runeAltar"
      },
      "prerequisites": [
        "New Blossoms"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Lead Into Gold, Kind of...",
          "longDescription": "You can convert a wide variety of things, all of which we\u0027ll list in the Lexica Botania. One of the most useful we\u0027ve found is turning Rotten Flesh into Leather!",
          "items": [
            {
              "item": {
                "id": "Botania:alchemyCatalyst"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Item Sacrificial Altar?",
          "longDescription": "You MUST bind the Altar to your Mana Network before you can create Runes. Look at your Lexica Botania to find out how. Then make a Mana Rune to test it.",
          "items": [
            {
              "item": {
                "id": "Botania:runeAltar"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 8
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Runes of Elements",
          "longDescription": "    Other than the Rune of Mana, the first tier of Runes are the Elements : Fire, Water, Earth, and Air. When you create any first tier Rune, you get two of them, which is super handy!                                 To boot, when you use a Rune in the Runic Altar to make something, the Rune is not consumed. It, instead, acts as a Catalyst, and will be given back when the item is created.",
          "items": [
            {
              "item": {
                "id": "Botania:rune"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 3
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Tiny Beauties",
          "longDescription": "    There are a few magical flowers you can miniaturize with an Alchemy Catalyst. They have a shorter range than normal flowers.                When this is done with a Passive Flower like the Daybloom, it instead becomes a Motif, which is purely for decoration and will not generate Mana, nor will it Decay.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"bellethornChibi\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Floral Conductor",
          "longDescription": "    Now that we are making a lot more Mana Generating flowers, and require much more Mana, we need a good way to connect these flowers to Mana Pools. Doing it one at a time is...tedius.                                      Enter the Floral Obedience Stick. Right Clicking it onto a Mana Pool will bind all relevant flowers within range to it. ",
          "items": [
            {
              "item": {
                "id": "Botania:obedienceStick"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 35
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 35
        }
      ]
    },
    {
      "name": "Better Equipment",
      "description": "One of the first things we did after discovering Manasteel is trying to forge it into tools. It seems that we can make armor, tools, and weapons out of it. Its a little stronger than Iron, and has more capacity for Enchantment. If you make and charge a Mana Tablet, the Manasteel equipment will consume Mana from it instead of taking damage. As well as protecting your Armor, a Mana Tablet can also be used in conjuction with this Blaster we devised. While you cannot fire Mana Bursts as potent as a Spreader, this makes it outright portable, which is good!",
      "x": 147,
      "y": 58,
      "icon": {
        "id": "Botania:manasteelChest"
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Pick Ore or Glass",
          "longDescription": "The Vitreous Pickaxe enables you to safely remove Glass without breaking it.",
          "items": [
            {
              "item": {
                "id": "Botania:manasteelPick"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:glassPick"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Do You Glow At Night?",
          "longDescription": "If you wear all four pieces of Manasteel armor, your Mana Tools take 10% less Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:manasteelChest"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:manasteelSword"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Tabula Mana",
          "longDescription": "Any item that can hold Mana, like this Tablet, can be charged by throwing it on top of a Mana Pool set to give Mana. You can change a Pool between Giving and Taking Mana by Sneak + Right Clicking it with your Wand of the Forest.",
          "items": [
            {
              "item": {
                "id": "Botania:manaTablet"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Bang Bang Bang!",
          "longDescription": "If you have any sort of Lens, you can combine it with the Blaster as well. Just craft the Blaster itself to remove the Lens.",
          "items": [
            {
              "item": {
                "id": "Botania:manaGun"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Bond Would Love This",
          "longDescription": "The Slingshot uses Vine Balls for Ammo, and will launch them pretty far. When the Vine Ball hits something, it will lower down strong Vines that can be climbed!",
          "items": [
            {
              "item": {
                "id": "Botania:slingshot"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:vineBall"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Cleansing Cloth",
          "longDescription": "Combining this Cloth with an Enchanted item will remove the Enchants from it. Good when you\u0027ve botched an Enchantment on a rare item!",
          "items": [
            {
              "item": {
                "id": "Botania:spellCloth"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Now You See It...",
          "longDescription": "    If you don\u0027t like looking like a Mega Zero in your spiffy blue armor, or any other Mana armor, you can combine a piece of it with Phantom Ink to make it invisible! You can also make your accessories like Rings invisible!                            Combining Phantom Ink with a Phantom\u0027d item will remove the effect.",
          "items": [
            {
              "item": {
                "id": "Botania:phantomInk"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Crafty Pockets",
          "longDescription": "    You can upgrade the Assembly Halo by combining it with a Mana Diamond to create the Manufactory Halo.                                            When you aren\u0027t holding the Halo, it will automatically try to do every crafting recipe saved on it, on a regular basis. We\u0027ve found this is a great way to automatically compress Cobblestone, or other similar things.",
          "items": [
            {
              "item": {
                "id": "Botania:autocraftingHalo",
                "nbt": "{rotationBase:386.84912f}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Battle of Gaia",
      "description": "The Elves have mentioned another material they use, but since its technically a living thing, they cannot send it to us. They have, however, told us how to obtain this material, called Gaia Spirits. Unfortunately, its fairly dangerous. It involves a ritual summoning of a Guardian, who you will have to slay to prove yourself worthy of obtaining the Spirits. The Elves warn me that this is VERY dangerous and will require excellent fighting skills, strong weapons, and excellent armor to survive. You will need to gather 9 blocks of strong material. Iron is the cheapest, but Gold, Emerald, and Diamonds work as well. Constructing the Ritual area is explained in your updated Lexica Botania, thanks to the Elves.",
      "x": 294,
      "y": 11,
      "bigicon": true,
      "icon": {
        "id": "Botania:pylon",
        "damage": 2
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Ritual Pylon",
          "items": [
            {
              "item": {
                "id": "Botania:pylon",
                "damage": 2
              },
              "required": 4,
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Fight of the Century",
          "longDescription": "When the Elves say it is a difficult fight, they mean it. Prepare to die often if you are ill-equipped. The Elves suggest a Terra Blade, Terrasteel Armor, and copious amounts of Brews!",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 5
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 35
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 4,
          "nbt": "{RepairCost:2,display:{Name:\"Lgndry Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 50
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Epic Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 5,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 80
        }
      ]
    },
    {
      "name": "New Blossoms",
      "description": "So we\u0027ve been trying various combinations of regular and Mana infused Petals to see if we can come up with some new Flowers. We made a breakthrough by adding more than just Petals to the Apothecary: carefully cutting some Grass with some Shears, and then coating it with Redstone Dust gave us a controlled way to add Redstone to the Apothecary. This lead to the discovery of two even more interesting Flowers! Both \u0027damage\u0027 creatures, but in different ways from each other. One of the assistants has been \u0027testing\u0027 them with flocks of chickens. Lots of chickens. We\u0027re pretty sure he just wanted the results for his barbecue...",
      "x": 147,
      "y": 127,
      "icon": {
        "id": "Botania:specialFlower",
        "nbt": "{type:\"bellethorn\"}"
      },
      "prerequisites": [
        "Mana Infusion"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Like Dust on the Wind",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 6
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Keep Pets Away!",
          "longDescription": "This Flower will damage ALL creatures, good or bad, around it, except for you and any other Assistants you have with you.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"bellethorn\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Slaughterhouse Endive",
          "longDescription": "Unlike the Bellethorne, this Flower will only kill Adult farm animals.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"dreadthorn\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 35
        }
      ]
    },
    {
      "name": "Special Eyes",
      "description": "    The eerie Endermen of your world has been a growing interest of many laboratories in The Ferret Business. Examining their Pearl-like eyes and doing some tests, we\u0027ve created various devices based on their strange, unique vision properties. Hopefully, they\u0027ll be helpful to you!",
      "x": 79,
      "y": 74,
      "icon": {
        "id": "Botania:enderEyeBlock"
      },
      "prerequisites": [
        "Mana Infusion"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Is That My Brand?!",
          "items": [
            {
              "item": {
                "id": "Botania:enderEyeBlock"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "One Sheep, Two Sheep...",
          "items": [
            {
              "item": {
                "id": "Botania:forestEye"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Shine Shine Monk",
          "longDescription": "    A Japanese tradition some folks here at the Ferret Business like to do is make these little dolls and hang them up when hoping for sunny weather.                               Making them out of Manaweave Cloth imparts some magical properties to the ghostly looking dolls. When you make one and place it somewhere, any Rainstorm or Snowstorm won\u0027t last as long.             A bonus, giving the Teru Teru Bozu a Sunflower by Right Clicking the flower onto it, or throwing it at it, will bring the sun back immediately.",
          "items": [
            {
              "item": {
                "id": "Botania:teruTeruBozu"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Flowers of Winter",
      "description": "    During the Winter, everything is dark, cold, and quiet. Flowers bide their time, waiting for spring, as people huddle and wait.                     The Winter encourages those still alive to eat to keep going, while the cold causes emotions to spike high as it effects how creatures move and react.",
      "x": 124,
      "y": 70,
      "icon": {
        "id": "Botania:specialFlower",
        "nbt": "{type:\"arcanerose\"}"
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Cold, Hungry, Angry",
          "longDescription": "    The Rune of Winter encompases the wet and cold lands.                     The Rune of Gluttony expands upon the need to eat as much as you can, when the cold times can offer very little.                              The Rune of Wrath expands in a different aspect, the fear of the dark and the cramped, cold months coalescing into anger to survive.         The Rune of Envy expands on the aspect of wanting that which others have in this cold time of the year.",
          "items": [
            {
              "item": {
                "id": "Botania:rune",
                "damage": 7
              }
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 10
              }
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 13
              }
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 14
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Stay Here",
          "longDescription": "    The Tangleberrie will create a wall of force that keeps creatures inside it, but does not prevent creatures from entering the circle.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"tangleberrie\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Keep Out",
          "longDescription": "    Conversely, the Jiyuulia will create a wall of force that keeps creatures out. It does not stop creatures inside the wall from walking out of it, though.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"jiyuulia\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Sluggish Thoughts",
          "longDescription": "The Medumone will heavily slow down any creature (other than you and your assistants, of course!) that get near it.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"medumone\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Knowledge and Power",
          "longDescription": "    The Entropinnyum is a special Flower. If you set off some TNT near it, the explosion will be absorbed and converted into a LOT of Mana.                                        The Rose Arcana, though, will consume your Experiences when you stand close to it, turning them into Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"entropinnyum\"}"
              }
            },
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"arcanerose\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Winter Feast",
          "longDescription": "    The Munchdew generates Mana by consuming Leaves. ",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"munchdew\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Flowers of Summer",
      "description": "    In the Summer, many flowers reach their full blooms, inviting fun celebrations!                                  During the Summer, flowers and people tend to consume more as they enjoy the heat, form friendships and enjoy their time together.",
      "x": 175,
      "y": 138,
      "icon": {
        "id": "Botania:specialFlower",
        "nbt": "{type:\"pollidisiac\"}"
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Warm Summer, Warm Feeling",
          "longDescription": "    The Rune of Summer encompases the Earth and Air, with all the fun of beach Sands and treats like Melon.                                            Building on the Summer Rune, the Rune of Lust encompases the Summer heat and joy, with a bit of love and passion.                            The Rune of Pride expands upon the feelings of superiority and importance of those who survived to this bountiful time.",
          "items": [
            {
              "item": {
                "id": "Botania:rune",
                "damage": 5
              }
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 9
              }
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 15
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Quite a Thirst",
          "longDescription": "    We\u0027re starting to require more and more Mana, so we need better Mana generating flowers. We\u0027ve found one that will drink a block of water in the 3x3 area around it. If the water it drinks is in an infinite water pool (Water physics in your world is...weird...), it won\u0027t consume the block when it drinks.                Hydroangeas only consume Water on the same level of it, and seem to work better when it is raining. Like Dayblooms and Nightshades, they will die off after a few days.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"hydroangeas\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Heating on Up",
          "longDescription": "    The Exoflame will heat up any Furnace nearby as long as it is fed Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"exoflame\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Slimy, Yet Satisfying",
          "longDescription": "    The Narslimmus will instantly kill naturally spawning Slimes in Slime Chunks, generating Mana from them. The Slimes will not split, nor will they drop anything.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"narslimmus\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Om Nom Nom",
          "longDescription": "    The Gourmaryllis is a very hungry plant, and will consume any edible Food in reach. Watch out, as it will overeat, but only generate Mana for the first Food item it grabs.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"gourmaryllis\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Love Potion #12",
          "longDescription": "    The Pollidisiac will ellicit a feeling of...well, something close to love, in farm creatures near it. And then Nature takes its course. Enough said.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"pollidisiac\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Hot Beverage",
          "longDescription": "    Thermalillies are similar to Hydroangea\u0027s, except they consume Lava instead of Water. They take a long while to cool down after consuming the hot drink, but provide a lot of Mana.                      If a Thermalilly consumes Lava within five minutes of it\u0027s last meal, it\u0027s cool down timer will reset, and not give you Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"thermalily\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Elven Flowers",
      "description": "The Elves have helped expand our botanical catalogue with a few special flowers. These, generally, either create or consume a LOT of Mana compared to the other flowers we\u0027ve made.",
      "x": 197,
      "y": 45,
      "icon": {
        "id": "Botania:specialFlower",
        "nbt": "{type:\"loonium\"}"
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "A Miner\u0027s Delight",
          "longDescription": "The Orechild is a very Mana hungry Flower, but for good reason. With enough Mana, it can transform Stone around it into a random Ore!",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"orechid\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "An Adventurer\u0027s Delight",
          "longDescription": "The Loonium requires a ton of Mana to feed it, but in return, it will a random item out of thin air, usually something old and mystical that looks right at home in a Dungeon chest.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"loonium\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Not My Enemy Nor Friend",
          "longDescription": "The Heisei Dream will alter a monster\u0027s vision so that instead of his own comrade, he will see his most hated enemy, and be filled with a burning rage so that he attacks them.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"heiseiDream\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Tasty Lie",
          "longDescription": "The Kekimuras is a bit more picky than the Gourmaryllis. It will only eat large Cakes placed around it.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"kekimurus\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Now You See It...",
          "longDescription": "This flower teleports items dropped near it to a defined point. You can define this point similar to how you Bind a Mana Spreader to a target. You can see the target of the Spectranthenam by Sneaking while holding your Wand of the Forest.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"spectranthemum\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Taste the Rainbow!",
          "longDescription": "The Spectrolus generates Mana by consuming Wool...but only certain colors at certain times. It will eat ALL wool dropped near it, but it will only generate Mana for the first White Wool it eats, then it will want the next color in the spectrum. The Spectrum is : White, Orange, Magenta, Light Blue, Yellow, Lime, Pink, Gray, Light Gray, Cyan, Purple, Blue, Brown, Green, Red, Black.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"spectrolus\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Blub Blub Blub",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"bubbell\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Hellish Mines",
          "longDescription": "The Orechild Ignem is like the normal Orechild, except it will produce Ores found in the Nether, and only in Netherrack.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"orechidIgnem\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Passive Rabble",
          "longDescription": "    Passive Flowers, such as the Daybloom and Nightshade, usually are only really good for jumpstarting ones Botaniacal adventures. They produce very little Mana in the scope of things, and don\u0027t last long.                          They are, though, not useless at all. The Rafflowsia is a special Elven flower that can consume Passive flowers to generate a decent amount of Mana. The Flowers just need to be planted close to it, and it will consume them.      The Rafflowsia will give diminishing returns if it consumes multiple of the same Passive flower in a row, so it\u0027s best to vary the flower\u0027s diet!",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"rafflowsia\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Flowers of Autumn",
      "description": "   Autumn brings about changes, both in people\u0027s minds and in the world around you.                          Both flowers and creatures look to change and prepare for winter. Stockpiling food, making things easier, protecting themselves for the harshness of the dark, cold months coming ahead.",
      "x": 184,
      "y": 166,
      "icon": {
        "id": "Botania:specialFlower",
        "nbt": "{type:\"tigerseye\"}"
      },
      "prerequisites": [
        "Flowers of Summer"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "The Colors of Change",
          "longDescription": "    The Rune of Autumn combines the warmth at the end of summer, with the airy winds of change.             The Rune of Sloth expands on the feelings of change, working in preperation towards the sedantary time of winter, slowing things down.",
          "items": [
            {
              "item": {
                "id": "Botania:rune",
                "damage": 6
              }
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 12
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Placing It Down",
          "longDescription": "    The Rannuncarpus will pick up items dropped near it and try to \u0027place\u0027 or \u0027plant\u0027 them on the ground. It will only place them on the same ground that the block under the block its planted on is: if the block under the dirt is Sand, it will only place the items on Sand. ",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"rannuncarpus\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Placing It In",
          "longDescription": "    The Hopperhock will pick up any item dropped close to it, and place it into a Chest or other inventory it can reach. If the inventory has an Item Frame in it, the Hopperhock will ONLY insert items that match ones already in the inentory.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"hopperhock\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Metamorphin Time",
          "longDescription": "    The Marimorphosis will transform regular Stone near it into decorative Stone, based on the Biome its located in. You can use this stone to make slabs and stairs, and also to make alternate versions of the Petal Apothecary!",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"marimorphosis\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Watching For Creeps",
          "longDescription": "    The Tigerseye seems give both the look and the presence of a very large Cat being present. If you have anything afraid of a Cat that\u0027s Creep\u0027n around, well...",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"tigerseye\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Where Ya Going?",
          "longDescription": "    Vinculotus is a strange, eerie Flower that is quite helpful when you are facing the Endermen. It will prevent them from being able to Teleport!",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"vinculotus\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Flowers of Spring",
      "description": "    Spring is a time of blossoms, of new growths after a hard, cold winter. The world comes back alive as the cold gives way to warmer rains, bringing life back to the world.",
      "x": 131,
      "y": 98,
      "icon": {
        "id": "Botania:specialFlower",
        "nbt": "{type:\"agricarnation\"}"
      },
      "prerequisites": [
        "Mana Infusion",
        "Teacher to Student"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Spring Blooms",
          "longDescription": "    The Rune of Spring encompasses new growths and new opportunities.                                  The Rune of Greed expands on the feeling of gathering all the new bounties Spring brings, lest a cold snap takes them away again.",
          "items": [
            {
              "item": {
                "id": "Botania:rune",
                "damage": 4
              }
            },
            {
              "item": {
                "id": "Botania:rune",
                "damage": 11
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Pushing On Out",
          "longDescription": "    The Daffomil will act like, well, a giant fan, and blow items away from it. You can aim a Daffomil much like you can a Mana Spreader : Sneak + Right click it, then Sneak + Right Click where you want it to blow towards.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"daffomill\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Potter\u0027s Delight",
          "longDescription": "    With enough Mana, the Clayconia will slowly transform Sand close to it into Clay.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"clayconia\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "To Die in a Dream",
          "longDescription": "    The Hyacidus causes heavy amounts of mental pain to all creatures, mimicing a Poison. The Poison will not kill the creature, only hurt it badly. It will not Poison you or your assistants.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"hyacidus\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "How Do They Work?",
          "longDescription": "    The Solegnolia is specifically for certain Mana Accessories that attract items, disabling their effect.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"solegnolia\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Watch My Mo...Flower Grow!",
          "longDescription": "    The Agricarnation infuses the land with Mana, increasing the speed in which crops grow. It can be controlled with a Redstone Signal.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"agricarnation\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Florist Delight",
          "longDescription": "    The Jaded Amaranthus will most likely be one of your best friends, as it will grow more Mystic Flowers with enough Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"jadedAmaranthus\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 4,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 25
        }
      ]
    },
    {
      "name": "Form and Function",
      "description": "The Living Wood and Stone blocks you\u0027ve made have a lot of amazing properties...but they also look fairly nice as well! You can arrange them in various ways to get more decorative blocks, even combine them with Seeds or Glowstone Dust to get other looks! This has inspired us to try making other materials more pleasing to look at as well! This isn\u0027t to say all some of these things do is look nice, some of them also do various interesting things as well. Maybe not quite useful, but interesting nonetheless.",
      "x": 157,
      "y": 182,
      "icon": {
        "id": "Botania:livingrock",
        "damage": 1
      },
      "prerequisites": [
        "Mana Infusion"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Arranged Patterns",
          "longDescription": "There are more patterns and designs than these. You can check them out in your Lexica Botania.",
          "items": [
            {
              "item": {
                "id": "Botania:livingrock",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "Botania:customBrick",
                "damage": 3
              }
            },
            {
              "item": {
                "id": "Botania:thatch"
              }
            },
            {
              "item": {
                "id": "Botania:livingwood",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "Botania:customBrick",
                "damage": 1
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Camo Pattern",
          "longDescription": "The Abstruse Platform is only solid to those who stand on top of it. If you walk through the side or under it, or Sneak while standing on it, you will drop through it. Mana Bursts will always pass through Abstruse Platforms. You can also hide the Abtruse Platform by right-clicking it with the block you wish to use as Camoflage.",
          "items": [
            {
              "item": {
                "id": "Botania:platform"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Scattered Mess",
          "longDescription": "The Open Crate is....only somewhat useful. If you like making a mess. Any items put into the Crate will instantly drop straight downward. Perhaps more useful, if you supply it a Redstone Signal, any item it drops won\u0027t be picked up by another Flower for a short bit.",
          "items": [
            {
              "item": {
                "id": "Botania:openCrate"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Round Baby Round",
          "longDescription": "We basically put a Mana Spreader onto a Piston and turned it up. For what? To spread Mana to Pools at a distance, of course!",
          "items": [
            {
              "item": {
                "id": "Botania:turntable"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Helping Hand",
          "longDescription": "Want to access your Ender Chest from anywhere? Use this Hand! ((Note that the recipe requies a vanilla Ender Chest, one that is made with mostly Obsidian))",
          "items": [
            {
              "item": {
                "id": "Botania:enderHand"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Petalistic Prose",
          "longDescription": "You can combine 9 of one petal color to make a decorative block.",
          "items": [
            {
              "item": {
                "id": "Botania:petalBlock",
                "damage": 2,
                "nbt": "{RepairCost:2,display:{Name:\"Any Color Petal Block\"}}"
              },
              "required": 2,
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 15
        }
      ]
    },
    {
      "name": "Quartz Conundrum",
      "description": "The Quartz you can find in the Nether has quite a lot of uses. It is also quite pretty when used to decorate with, and we\u0027ve been able to combine it with various materials to give you even more decorative ideas! You can even throw it into a Plain Mana Pool to infuse it. If you throw it into a Mana Pool augmented with a Catalyst, though, you get something completely different!",
      "x": 214,
      "y": 151,
      "icon": {
        "id": "Botania:quartz",
        "damage": 4
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Rainbow Quartz",
          "longDescription": "These special varieties of Quartz can be made into Blocks and Slabs and Pillars just like regular Quartz.",
          "items": [
            {
              "item": {
                "id": "Botania:quartz",
                "damage": 3
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:quartz",
                "damage": 4
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:quartz",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:quartz",
                "damage": 6
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Designer Quartz",
          "longDescription": "You can arrange Quartz into a patterned block called an Azulejo. You can rearrange the patterns of it in a dozen different ways by simply crafting the Azulejo itself.",
          "items": [
            {
              "item": {
                "id": "Botania:customBrick",
                "damage": 4
              },
              "precision": "FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Aquatic Quartz",
          "longDescription": "Quartz infused in a Mana Pool with an Alchemical Catalyst creates Prismarine. You can combine these into a Block, and you can also combine them with a Glowstone Block to create a lovely Lantern.",
          "items": [
            {
              "item": {
                "id": "Botania:prismarine"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:seaLamp"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Special Stones",
          "longDescription": "There are four special stone varients you can make as well, sort of a glimpse into the future. The first you can get by tossing Stone into an Alchemy augmented Mana Pool, then each result can be thrown in again for a different one. You can then turn these into Polished versions, as well as Stairs and Slabs the normal way.",
          "items": [
            {
              "item": {
                "id": "Botania:stone"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:stone",
                "damage": 3
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:stone",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:stone",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Wild Creations",
      "description": "    My assistants have been quite busy lately exploring all the possibilities Botania has to offer us. Most of what we\u0027ve found has to deal some way with Nature, which isn\u0027t surprising given this is a Flower basic magic system. To that, we have created a good handful of various tools, items, and implements for you.                                        One assistant has found a way to easily change the lands into Mycellium or Podzol, letting you enrich the ground around you. Another assistant has created quite pretty decorations in their effort to discover more uses. My last assistant has been combining music theory with his research, and while somewhat odd, he has come up with a few items of his own to help you!",
      "x": 114,
      "y": 179,
      "icon": {
        "id": "Botania:miniIsland",
        "damage": 10
      },
      "prerequisites": [
        "Mana Infusion"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Spreading The Pasture",
          "longDescription": "    There are three normal types of Pasture Seeds and six special types. Each will instantly grow Grass or more on Dirt.                    The normal Pasture Seeds turn dirt or grass into some common types : Pasture grows Grass, Boreal grows Podzol, and Infested grows Mycellium.                              The six special Pasture Seeds make decorative grass variants. For example, Mutated Pasture Seeds make a purpley looking Grass!",
          "items": [
            {
              "item": {
                "id": "Botania:grassSeeds"
              }
            },
            {
              "item": {
                "id": "Botania:grassSeeds",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "Botania:grassSeeds",
                "damage": 2
              }
            },
            {
              "item": {
                "id": "Botania:grassSeeds",
                "damage": 8
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Floating Flowers",
          "longDescription": "By coating a Mystical Flower in Glowstone Dust, you get a Glowing Mystical Flower, which emits light. By adding it to some dirt with a Pasture Seed, you make it its own floating island! You can then combine this Floating Flower with any flower with an effect to place THAT flower on the island instead!",
          "items": [
            {
              "item": {
                "id": "Botania:shinyFlower",
                "damage": 10
              }
            },
            {
              "item": {
                "id": "Botania:miniIsland",
                "damage": 10
              }
            },
            {
              "item": {
                "id": "Botania:floatingSpecialFlower",
                "nbt": "{type:\"daybloom\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "The Wild Call",
          "longDescription": "Making a horn out of Livingwood and decorating it with a Pasture Seed creates a powerful Horn. When blown, will uproot all vegetation nearby, dropping Seeds and Plants for you to retrieve. Combine the Horn with some Leaves, and instead the Horn will destroy Leaves. Combining the Horn with a Snowball will instead let it destroy Snow.",
          "items": [
            {
              "item": {
                "id": "Botania:grassHorn"
              }
            },
            {
              "item": {
                "id": "Botania:grassHorn",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "Botania:grassHorn",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Wild Drumbeat",
          "longDescription": "By encasing a Horn in Livingwood, and topping it with Leather to create a Drum, you get a stationary device that reacts to Mana Bursts. When one hits it, it acts as if you blew the original Horn itself.",
          "items": [
            {
              "item": {
                "id": "Botania:forestDrum"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:forestDrum",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Spark of Life",
          "longDescription": "These little Sparks of life are somewhat handy! You can place one on top of a Mana Pool, then another on any device that requires Mana (That you\u0027d usually hit with a Mana Burst, for example), and it can instead tap into the Mana Pool\u0027s reservoir, as long as it isn\u0027t too far away.",
          "items": [
            {
              "item": {
                "id": "Botania:spark"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Power Tools",
      "description": "Bandit, a lot of the different research areas of The Business have been sharing your findings with each other. Various labs are requesting ways to convert Mana into their respective power systems. There are very few ways we\u0027ve found, unfortunately, but there are three things we ARE able to help them with. One converts to the most common power system currently, one doesn\u0027t convert Mana, but instead translates movement across a distance, and the last one is...well, its more of just a morale booster.",
      "x": 71,
      "y": 105,
      "icon": {
        "id": "Botania:rfGenerator"
      },
      "prerequisites": [
        "Mana Infusion"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Conversionary Tactics",
          "longDescription": "This block converts Mana directly into RF Energy. Unfortunately, this conversion is only ONE way. You cannot convert RF back into Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:rfGenerator"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Monkey See, Monkey Do",
          "longDescription": "You can infuse a Piston with Mana, and then Bind it (like a Mana Spreader) to another block. The Piston will still push this item back and forth as if it were in front of the Piston. Initially not that useful, but we discovered we could move the Mana infused Piston around and it would not effect the Bound block. ",
          "items": [
            {
              "item": {
                "id": "Botania:pistonRelay"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Your Own Mascot!",
          "longDescription": "    This little guy is cute. No idea what he does other than look cute. Isn\u0027t that enough?                           Hey, you can even name it on an Anvil! I wonder if certain names would....",
          "items": [
            {
              "item": {
                "id": "Botania:tinyPotato"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Crafters, Assemble!",
          "longDescription": "The Assembly Halo lets you craft on the go, without having to place down a Workbench all the time. Holding the Halo will show you a ring around you. Right click the Workbench to start crafting, loading the last recipe you made with it if you have all the pieces. Right clicking an empty spot on the Halo will save the saved recipe to it, and you can right click this area to craft it again if you have the parts. Empty a saved recipe by Sneak + Left Clicking it.",
          "items": [
            {
              "item": {
                "id": "Botania:craftingHalo",
                "nbt": "{rotationBase:472.4436f}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Lively Archer",
          "longDescription": "The Livingwood Bow will fire normal arrows like any other standard bow, but it will also repair itself with Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:livingwoodBow"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Burning Lamp",
          "longDescription": "The Blaze Lamp condenses Blaze Rods into a light source. It can also be used as a Solid Fuel, or turned into Obsidian by a Pure Daisy.",
          "items": [
            {
              "item": {
                "id": "Botania:blazeBlock"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Grain of Sand",
          "longDescription": "    Keeping an accurate timer is easily done with computers, but it lacks...elegance and a bit of magic, you know? So, we came up with this Hourglass. By inserting sand into it, it will tick down and emit a Redstone pulse before flipping itself over.        How long depends on how much and what kind of sand you add. Regular Sand is 1 second each, Red Sand 10 seconds, and Soul Sand 1 minute. You can only add one type of Sand at a time, and you have to be holding the exact amount you want.                                           We\u0027ll detail this more thoroughly in your Lexica Botania.",
          "items": [
            {
              "item": {
                "id": "Botania:hourglass"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Squared Circle",
          "longDescription": "    Given the... blocky... nature of things, sometimes it is hard to build something circular in design. When done properly, it looks aesthetically pleasing! Otherwise, it just looks... lopsided?                       Well, Manasteel seems to give some special properties to normally mundane tools, and a Sextant is no different. You can hold Right Click the Worldbuilder\u0027s Sextant onto a block you want as the center of a circle, then look outward to change the size of the blue line that appears.                                        When you release Right Click, ghostly Cobblestone will appear as a building guide. Super handy! You can Right Click one of these ghost blocks with your Worldbuilder\u0027s Sextant to dismiss the guide.",
          "items": [
            {
              "item": {
                "id": "Botania:sextant"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 15
        }
      ]
    },
    {
      "name": "Quite a Spectacle",
      "description": "Lately we\u0027ve been wondering if there are ways we could alter the Mana Bursts themselves. We\u0027re creating lots of new Flowers lately, but that is only one side of the equation, right? Well, two sides, some Flowers MAKE Mana, some Flowers TAKE Mana. But what about in-between? I mean specifically the Mana Network and the Mana Bursts themselves. We decided to see if we could effect the Mana Bursts, and I decided to try making a giant Lens out of glass and Manasteel. Well, it didn\u0027t seem to do anything, until one of the assistants spilled some Dye on the lens, and suddenly the Mana Burst that passed through it turned a different color! Since then, I\u0027ve had all my assistants researching and testing new Lenses. We\u0027ve come up with a whole lot! We\u0027ve also found you can combine two Lenses together : the Lens will look like the first one, but have the effects of both. Not all Lenses seem to work together though.",
      "x": 103,
      "y": 56,
      "icon": {
        "id": "Botania:lens"
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "A Plain Lens",
          "longDescription": "Alone, this Lens does nothing. You can combine it with some Dye to color the Mana Burst though!",
          "items": [
            {
              "item": {
                "id": "Botania:lens"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Altering the Beam",
          "longDescription": "Potency increases the amount of Mana each Burst can have. Resistance will increase the time before a Mana Burst starts losing Mana. Efficiency will decrease the time, but also decrease how much Mana is lost over time.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 3
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 4
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Altering the Reaction",
          "longDescription": "Bounce causes Mana Bursts to bounce off objects instead of breaking on them. Gravity makes the world\u0027s gravity effect the Burst, making it arc downward. Bore enables the Burst to break blocks it hits, consuming Mana from the Burst itself.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 5
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 6
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 7
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Altering the Effect",
          "longDescription": "Damaging causes the Burst to damage creatures it passes through. Kindle sets a block on Fire if it hits it, but not creatures. Entropic causes the Mana Burst to explode when it breaks on a block.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 8
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 15
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 11
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Altering the Influence",
          "longDescription": "Influence will cause all nearby fallen items to move along the same vector as the Burst. Force pushes the block the Burst hits as if it was pushed by a Piston. Weight causes blocks the Burst hits to fall like Sand.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 12
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 16
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 13
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Altering the Beam Again",
          "longDescription": "Phantom causes the Burst to pass though blocks. Velocity causes the Burst to travel much faster, but start losing Mana faster. Magnetizing causes the Burst to home in on devices that can store mana.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 9
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 10
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Altering the Heat",
          "longDescription": "The Flash Lens will create a magical fire where the Burst hits. It will be colored the same as the Lens, but only provide light, as it is a decorative flame. Another Burst from a Flash Lens will put the flame out.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 17
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 15
        }
      ]
    },
    {
      "name": "Accessorizing",
      "description": "Manasteel is quite pretty, I have to say. Its become a bit of a lab fashion to wear a ring or necklace of Manasteel. It also gives us a handy piece of material to test things with. It was inevitable, then, for us to consider the possibility of giving function to our form. We immediately began researching posibilities of harnessing Mana and overall magical effects we\u0027ve discovered thus far in useful little packages : jewelry. True, it is a bit of a trope to have magical rings and necklaces, but we ARE working with Magic so... ((You can access your Jewelry by pressing the ring to the upper right of your portrait in your Inventory. Or you can bind a button to Baubles in your options menu))",
      "x": 125,
      "y": 40,
      "icon": {
        "id": "Botania:auraRing"
      },
      "prerequisites": [
        "Better Equipment",
        "Quite a Spectacle"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "How Many Karats is Mana?",
          "longDescription": "The Band of Aura will generate Mana slowly and put it into any Mana storing items in your inventory, such as a Mana Tablet, or the Band of Mana, which stores Mana as well.",
          "items": [
            {
              "item": {
                "id": "Botania:manaRing",
                "damage": 1000
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:auraRing"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Weighty Conversions",
          "longDescription": "The Soujourners Sash will make you lighter, allowing you to move faster and jump higher. The Tectonic Girdle, conversely, makes you heavier and invincible against knockback effects.",
          "items": [
            {
              "item": {
                "id": "Botania:travelBelt"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:knockbackBelt"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Dark Oceans, Dark Mines",
          "longDescription": "The Ring of Chordata will clear your vision when you are under water, and if you are carrying Mana in a Tablet or Ring, you\u0027ll also breath underwater. The Ring of the Mantle will speed up your hands a bit, making you mine faster.",
          "items": [
            {
              "item": {
                "id": "Botania:miningRing"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:waterRing"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Tools of Temperature",
          "longDescription": "The Pyroclast Pendant will put you out if you catch on Fire, but will not save you if stand IN Fire...or Lava for that matter. The Snowflake Pendant will turn water under your feet into Ice temporarily, but not if you are IN the water. That\u0027d be...disasterous.",
          "items": [
            {
              "item": {
                "id": "Botania:lavaPendant"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:icePendant"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Eyes Slightly Squinting",
          "longDescription": "The Spectator will highlight inventories that contain the same item you are currently holding. You can also crouch, and it will highlight all dropped items around you. The Ring of Magnetization will draw in all dropped items around you when not Sneaking. It will stop magnetizing for 5 seconds if you toss an item out of your inventory.",
          "items": [
            {
              "item": {
                "id": "Botania:itemFinder"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:magnetRing"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "It\u0027s Not Ah Plutoh!",
          "longDescription": "As long as you have the Tiny Planet equipped, Mana Bursts close to you will fly towards you, then orbit around you. You can also encase it in a pedastal of Stone, to have a stationary version.",
          "items": [
            {
              "item": {
                "id": "Botania:tinyPlanet"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:tinyPlanetBlock"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Tool of Brew",
          "longDescription": "This Pendant can be used in place of a Vial in the Botanical Brewer to imbue that effect into the Pendant. While worn, the Imbued effect will consume Mana. Keep in mind not all Brews can be Imbued into a Pendant.",
          "items": [
            {
              "item": {
                "id": "Botania:bloodPendant"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Swippity Swap",
          "longDescription": "The Ring of Correction will automatically swap the tool you are using to one more appropriate for breaking the material you are working on. It will only works with Mana Tools though.",
          "items": [
            {
              "item": {
                "id": "Botania:swapRing"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Accessorizing Accesories",
          "longDescription": "These accessories allow you to add more flair to your jewelry ensemble, or to change the look of your Botania accessories! There are 32 different ones, and you can combine one with any Botania accessory that goes in the same slot to change its look. You can also just wear it as it is.",
          "items": [
            {
              "item": {
                "id": "Botania:cosmetic",
                "damage": 26
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:cosmetic",
                "damage": 23
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:cosmetic",
                "damage": 31
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Best Bellow It",
          "longDescription": "    Accessories are not only for you and your assistants!                  The Manatide Bellows can be connected to the side of a Mana Pool to increase the rate it outputs Mana. You can also place it against a Furnace to speed it up.                  Do note that the Bellows don\u0027t work on their own when speeding up a Furnace, you will need to man them.",
          "items": [
            {
              "item": {
                "id": "Botania:bellows"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Fancy Case",
          "longDescription": "    With all these Accessories you can make, it feels odd to only be storing them in normal chests and boxes, you know?                            To that, we\u0027ve come up with a handy Bauble Case! It\u0027s kind of like a Jewelry Case, but for Baubles! You can use it to store and swap between your various Baubles, and it can even hold Mana storing items for you.",
          "items": [
            {
              "item": {
                "id": "Botania:baubleBox"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Speedwalking",
          "longDescription": "    The Planestrider\u0027s Sash is an alternate to the Sojourner\u0027s Belt. Instead of outright boosting your speed, you will speed up as you walk around.                                  If you walk enough, you will go much faster than the Sojourner\u0027s Sash or similar accessory.",
          "items": [
            {
              "item": {
                "id": "Botania:speedUpBelt"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Strength of the Earth",
      "description": "We\u0027ve discovered quite a stronger material than the Manasteel you\u0027ve been using. By infusing together Manasteel, Mana Diamonds, and Mana Pearls, along with a ton of Mana, you can create this green metal. It has great Mana harnessing ability we\u0027ve found in our initial tests. To create it, you\u0027ll need to create a ritual area : a 3x3 checkerboard of Livingrock and Lapis Lazuli blocks, with a Terrastial Agglomeration Plate atop the center. Look at your Lexica Botania for a better explanation on how to do this. Meanwhile, while we do more tests, we\u0027ve already created a few new tools for you to use with this new material!",
      "x": 168,
      "y": 71,
      "icon": {
        "id": "Botania:manaResource",
        "damage": 4
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Is It...Nuclear?!",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 4
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Leaf Blade",
          "longDescription": "Every time you swing this Sword, it seems you have a small chance of also releasing a Mana beam that will damage your targets as well!",
          "items": [
            {
              "item": {
                "id": "Botania:terraSword"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Mirror, Mirror",
          "longDescription": "Instead of having to recharge a Mana Tablet all the time, you can use this Mirror. Sneak + Right click it on a Mana Pool to bind it, and it will directly draw Mana from that pool for your items.",
          "items": [
            {
              "item": {
                "id": "Botania:manaMirror",
                "damage": 1000,
                "nbt": "{posX:0,posY:-1,posZ:0,manaVisual:0,dim:0}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "The World Next Door",
      "description": "Through careful study and some mystical hints scattered through some of the magic of these flowers and constructions, we\u0027ve discovered there is a world right next to yours, just sliiightly out of alignment. Another race of creatures used to live in your current world, but do not any longer. I think we can contact them with the power of Botania magic! I\u0027ve written down how to make all the items you\u0027ll need in the Lexica Botania. I don\u0027t think you\u0027ll have enough power to send much once you construct and open the gate, but....wait, throw your Lexica Botania in first, then a block of Living Wood to show that you\u0027ve learned some of their knowledge!",
      "x": 192,
      "y": 71,
      "icon": {
        "id": "minecraft:end_portal"
      },
      "prerequisites": [
        "Strength of the Earth",
        "Power and Elegance"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Knowledge Exchange",
          "longDescription": "We\u0027ve recently added some interesting things to your Lexica Botania. On pages like the Alfheim Portal, you can have it display the multiblock in the world so you know where to place items! Also, don\u0027t forget, to keep the portal open requires a constant stream of Mana!",
          "items": [
            {
              "item": {
                "id": "Botania:dreamwood"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 50
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Epic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 35
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 50
        }
      ]
    },
    {
      "name": "Otherworld Materials",
      "description": "We\u0027ve read the passages in your updated Lexica Botania, which now seems to be linked to the...Elven?...world. Looks like both of our groups will be giving you lots of information! The first thing we need to do is trade the Elves some of the resources they are missing and see what they give us in return.",
      "x": 226,
      "y": 57,
      "icon": {
        "id": "Botania:manaResource",
        "damage": 7
      },
      "prerequisites": [
        "The World Next Door"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Pleasant Wood",
          "items": [
            {
              "item": {
                "id": "Botania:dreamwood"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Strong Metal",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 7
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Draconic Gemstone",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 9
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Magical Pearl Dust",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 8
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Elvish Gem",
          "items": [
            {
              "item": {
                "id": "Botania:quartz",
                "damage": 5
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Gorgeous Glass",
          "longDescription": "    Like Managlass, Alfglass can be turned into Panes.",
          "items": [
            {
              "item": {
                "id": "Botania:elfGlass"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Yet A Different World",
          "longDescription": "This is something the Elves mentioned to us : If we can capture the air of the world we call The End in a Glass Bottle, we can use it in various ways. Throwing it at some normal Stone seems to change it to End Stone. I think with The Business doing all this research, we should be able to make a...reasonable facimile...check your Store page.",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 15
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Power and Elegance",
      "description": "We\u0027ve tested a few things with the Alchemy Catalyst and have discovered a few extra things, like creating a rough dirt that grass will not grow on, and is great for making special paths. Meanwhile, we\u0027ve also been advancing research of infusing items with Mana. We decided to see if we could create a sort of Focus. It will draw energies from the earth to power up many of your advanced Botanical creations. If you put it near an Enchanting table, it\u0027ll increase the power of the Enchants you can imbue, for example. Its quite useful when you don\u0027t want to have a giant box of bookcases around the little enchanting table...But speaking of Enchanting, we had a visit from one of the Thaumaturgic research lab to discuss some similarities between our Occult fields. With his help, we have been able to construct a sort of...ritual area using these Pylons, that enables us to  do some advanced Enchanting. I\u0027ve written down all you need to know in your Lexica Botania.",
      "x": 188,
      "y": 97,
      "icon": {
        "id": "Botania:pylon"
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "You Must Overuse Phrases",
          "longDescription": "This has also become useful as a Ritual Focus in Thaumaturgic rituals.",
          "items": [
            {
              "item": {
                "id": "Botania:pylon"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Beaten Path",
          "longDescription": "You can toss regular Dirt into a Mana Pool augmented with an Alchemy Catalyst to get a coarser version, which can then be used to make these ornamental footpaths.",
          "items": [
            {
              "item": {
                "id": "minecraft:dirt",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "Botania:dirtPath"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 10
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Strength of Gaia",
      "description": "These Gaia Spirits are...amazing. The material is unlike anything many of the other Occult branches have seen yet. We\u0027ve begun careful research since it is very difficult to get a reasonable amount of of the material, but we\u0027ve already created a few things you may be interested in.",
      "x": 262,
      "y": 11,
      "icon": {
        "id": "Botania:spawnerMover"
      },
      "prerequisites": [
        "Battle of Gaia"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Mana Spreader Mk III",
          "longDescription": "The top tier of Mana Spreaders, this is improved in every single way.",
          "items": [
            {
              "item": {
                "id": "Botania:spreader",
                "damage": 3
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Take It, Put It Over Here",
          "longDescription": "Monster Spawners are quite fragile, you cannot remove them easily without breaking them. The Life Aggregator allows you to pick up a Spawner and place it down somewhere else. You can only do this once per Aggregator though.",
          "items": [
            {
              "item": {
                "id": "Botania:spawnerMover"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Better Than Stainless",
          "longDescription": "When put on any tool that normally takes Damage with use, Timeless Ivy will instead allow the tool to consume Mana you are carrying in place of Damage, much like Mana and Terrasteel tools do.",
          "items": [
            {
              "item": {
                "id": "Botania:regenIvy"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Raising The Land",
          "longDescription": "BE VERY CAREFUL WITH THIS! When you use the Shard of Laputa on the ground at your feet, it will infuse a sphere around 14 meters radius with Mana, and then piece by piece raise it high into the sky. You cannot stop it once it starts! You can also increase the radius by a meter or two with each Gaia Spirit you combine with the Shard of Laputa.",
          "items": [
            {
              "item": {
                "id": "Botania:laputaShard"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Aim at the Darkness!",
          "longDescription": "This Rod, at the cost of lots of Mana, will constantly summon Arcane Missles that target enemies around you randomly.",
          "items": [
            {
              "item": {
                "id": "Botania:missileRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "ROUND TWO!",
          "longDescription": "Crafting this and using it in the Gaia summoning will summon an even stronger, deadlier Gaia. The risk, though, comes with great rewards if you succeed!",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 14
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Holy Roller",
          "longDescription": "The Dice of Fate is a special reward to those brave enough to face the challenge of Gaia. The Elves say that the Gods play Dice with the Universe, and you can as well. By rolling the dice, you can get one of six different Relics. The legend says a person can only ever get one of each Relic.",
          "items": [
            {
              "item": {
                "id": "Botania:dice"
              },
              "precision": "FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Big Bada Boom",
          "longDescription": "    Be careful with this. Using a Gaia Spirit to super charge some TNT is a dangerous, foolish endeavour, but...it looks so cool!                         You can only set the Manastorm Charge off with a Mana Burst. This will create a Manastorm Epicenter, which will fire Mana Bursts in all directions, which WILL EXPLODE when they hit something.",
          "items": [
            {
              "item": {
                "id": "Botania:manaBomb"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Elven Games of Life",
          "longDescription": "    The Elves speak of something that is a combination of a Game and a source of Mana. By using Guardian Spirits to create a special Flower, and using logic and reasoning, you too can play it.            The Dandelifeon requires a 25x25 block area to function properly, with the Dandelifeon placed in the center.                        If you understand the rules to Conway\u0027s Game of Life, you\u0027ll understand a good portion of this....Game. You\u0027ll need some Cellular Blocks, made from Cactus, as well. Look in your Lexica Botania for more information.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"dandelifeon\"}"
              }
            },
            {
              "item": {
                "id": "Botania:cellBlock"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 45
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 4,
          "nbt": "{RepairCost:2,display:{Name:\"Lgndry Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 40
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Epic Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 4,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 85
        }
      ]
    },
    {
      "name": "Charms of Gaia",
      "description": "Gaia Spirits seem to eminate with quite a lot of power. I\u0027ve given each of my assistants a few Spirits each to research, and with the help of the Elves, we\u0027ve come up with some excellent Accessories you can make use of.",
      "x": 302,
      "y": 48,
      "icon": {
        "id": "Botania:divaCharm"
      },
      "prerequisites": [
        "Battle of Gaia"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Come Fly Away",
          "longDescription": "    Ever wanted to the fly? Make yourself a Flugel Tiara! It gives you short term flight when worn, which is quite useful.                        While flying, you can Dash in the direction you are facing by hitting the Run button. You can also Glide by Sneaking while flying or falling.",
          "items": [
            {
              "item": {
                "id": "Botania:flightTiara"
              },
              "precision": "FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Crossing The Globe",
          "longDescription": "An improvement to the Soujourner Sash, Gaia Spirits give it a big speed boost!",
          "items": [
            {
              "item": {
                "id": "Botania:superTravelBelt"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Stellar Diva",
          "longDescription": "While wearing this Charm, when you strike an enemy and have enough Mana, you will temporarily convert the enemy to your side to protect you.",
          "items": [
            {
              "item": {
                "id": "Botania:divaCharm"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Not Even Death",
          "longDescription": "This Crown will prevent you from dieing. Once, that is. If you are wearing this when you die, the Crown will break and you will still live.",
          "items": [
            {
              "item": {
                "id": "Botania:goldenLaurel"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "All Fired Up",
          "longDescription": "A serious improvement to the Pyroclast Pendant, the Crimson Pendant will even allow you to stand in Lava with no problems.",
          "items": [
            {
              "item": {
                "id": "Botania:superLavaPendant"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Cloaks of Heaven and Hell",
          "longDescription": "These two Cloaks go into your Belt slot. They activate when you take damage, then take 10 seconds to recharge. The Cloak of Virtue will block all damage of a single strike, while the Cloak of Sin will damage all hostile enemies around you for the same amount of damage.",
          "items": [
            {
              "item": {
                "id": "Botania:holyCloak"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:unholyCloak"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 45
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Epic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 40
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Epic Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 85
        }
      ]
    },
    {
      "name": "Even Better Equipment",
      "description": "Like Manasteel, you can forge the Terrasteel into various pieces of armor. Its much stronger than Manasteel, resembling the strong crystalline structure of Diamonds, without the brittleness. Like Manasteel armor, it will consume Mana from a tablet before taking damage itself. We then tried to make more tools with the Terrasteel, but unlike its Manasteel counterpart, only a few of these tools actually functioned well...and boy did they function! Two of these tools will be quite useful to you, as they\u0027ll help you carve your own place into that deserted world.",
      "x": 152,
      "y": 28,
      "icon": {
        "id": "Botania:terrasteelChest"
      },
      "prerequisites": [
        "Strength of the Earth",
        "Magic Staves"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Its Either Nature or Nuclear",
          "longDescription": "Wearing all four pieces of Terrasteel armor will allow you to renegerate health even if you hunger bar isn\u0027t full, and your Mana tools will take 10% less Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:terrasteelChest"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Strike the Earth",
          "longDescription": "The Terra Shatterer is special. We\u0027ve found we can feed it Mana by Charging it like any other Mana containing item, but you cannot take Mana out. Instead, as it holds more and more Mana, the more powerful it becomes. After you\u0027ve charged it with some Mana, you\u0027ll have to activate it by Right Clicking.",
          "items": [
            {
              "item": {
                "id": "Botania:terraPick",
                "nbt": "{mana:9999}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Bending The Terrain",
          "longDescription": "Be careful with this! This tool is able to terraform large areas of land around you as you use it, though it takes a LOT of Mana. Unlike the Terra Shatterer, this destroys all the materials in the process!",
          "items": [
            {
              "item": {
                "id": "Botania:terraformRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Warrior Princess",
          "longDescription": "This weapon is thrown with a Right Click, where it will pierce through enemies and possibly poison them. It can bounce off a few walls before returning to you like a boomerang.",
          "items": [
            {
              "item": {
                "id": "Botania:thornChakram"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Bigger Pull",
          "longDescription": "    By adding some Terrasteel to the Ring of Magnetization, you get a more powerful version that has a farther distance!",
          "items": [
            {
              "item": {
                "id": "Botania:magnetRingGreater"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Magic Staves",
      "description": "All these Magical creations and processes, from Alchemy to Altars to Magic Rings, have given us the idea to keep expanding on the Wizard angle of Magic. More precisely, what is a Wizard without an old, gnarly Staff that can do something Magical? Probably not old and wise enough, I guess. Or he doesn\u0027t have a bad leg or back...Where was I? Oh yes! We\u0027ve utilized the power of various materials like Runes, which have created quite a variety of useful Staves for you to use.",
      "x": 243,
      "y": 126,
      "icon": {
        "id": "Botania:fireRod"
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Flame On!",
          "longDescription": "Aim this staff at the ground and activate it, and a low ring of Fire will appear around you. I suggest running, because after a few seconds, it won\u0027t be a small ring anymore. It will burn everything inside it...including you!",
          "items": [
            {
              "item": {
                "id": "Botania:fireRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Aqua Laguna",
          "longDescription": "For just a bit of Mana, wherever you activate this Rod will create Water! This is especially helpful as you can use it to instantly refill a Petal Apothecary.",
          "items": [
            {
              "item": {
                "id": "Botania:waterRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Like a Bird",
          "longDescription": "When you activate this, it will propel you 20 meters up into the air, and then start recharging. As long as it is recharging, you will not take fall damage.",
          "items": [
            {
              "item": {
                "id": "Botania:tornadoRod",
                "nbt": "{flying:0b}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Not A Jar But It Will Do",
          "longDescription": "This lets you create blocks of Dirt on the spot. As if you didn\u0027t have enough of them.",
          "items": [
            {
              "item": {
                "id": "Botania:dirtRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Sight Beyond Sight",
          "longDescription": "When you activate this Rod, it will highlight many Ores all around you.",
          "items": [
            {
              "item": {
                "id": "Botania:diviningRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Slice the Soul",
          "longDescription": "While not a Staff, this Knife has a very particular set of abilities. Abilities that make it a nightmare for Endermen in your world. If you strike one with this, it will be the death of it. But if you do, you can only strike a few times, and then it will break on you.",
          "items": [
            {
              "item": {
                "id": "Botania:enderDagger"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Drop Like a...Rock?",
          "longDescription": "Works like the Rod of Lands, but summons a block of Cobblestone instead.",
          "items": [
            {
              "item": {
                "id": "Botania:cobbleRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Heavy Heat",
          "longDescription": "This has the ability to change a block of material into another. Cobblestone turns into Stone, Sand into Glass, etc.",
          "items": [
            {
              "item": {
                "id": "Botania:smeltRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "World Shift",
          "longDescription": "    The Rod of the Shifting Crust is quite a handy tool. It allows you to swap materials placed in the world with a material in your inventory.         To select what block you want to swap to, Shift + Right Click this Rod on it. You can then Left Click any solid block with the Rod to swap it with the chosen one, as long as it is in your inventory.                           Right Clicking, though, will cause a larger transformation, swapping all highlighted blocks instead. Remember, this requires both Mana and the blocks in your inventory!        Also, if you have certain other Rods in your inventory, you can augment the Swap. Rod of the Lands, for example, will allow you to swap for Dirt infinitely, as long as you can pay the Mana cost for generating the Dirt as well.",
          "items": [
            {
              "item": {
                "id": "Botania:exchangeRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "What a Stand In",
          "longDescription": "    The Livingwood Avatar is a mannequin made of Livingwood and a Mana Diamond, that can be given certain Rods and they will function similarly as if you were using them yourself.                                       A good example is the Rod of the Skies. Giving it to a Livingwood Avatar allows you or any of your Assistants the ability to jump high when near the Avatar.",
          "items": [
            {
              "item": {
                "id": "Botania:avatar"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 25
        }
      ]
    },
    {
      "name": "Elven Upgrades",
      "description": "These Elven materials are fantastic, and the Elves themselves are quite intrigued by what we\u0027ve learned and discovered. With their help, we\u0027ve come up with a handful of new and upgraded devices you can use.",
      "x": 204,
      "y": 19,
      "icon": {
        "id": "Botania:spreader",
        "damage": 2
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Spreading More Joy",
          "longDescription": "You can make an upgraded Mana Spreader with Dreamwood. It will fire more Mana Bursts, with more Mana, that last longer before they begin to lose Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:spreader",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Batteries May Be Included",
          "longDescription": "The Elves found the Open Crate...amusing. They also had an idea on how to make it more useful. You can pipe items into it in a specific order to automatically craft them. The Placeholder is for when an item has an \"Empty\" spot. Look at your upgraded Lexica Botania for more detailed instructions.",
          "items": [
            {
              "item": {
                "id": "Botania:openCrate",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 11
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Ghost in the Wall",
          "longDescription": "An upgraded version of the Abtruse Platform. It works just like it, except now everthing can pass through it.",
          "items": [
            {
              "item": {
                "id": "Botania:platform",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Magical Gathering",
          "longDescription": "An improved version of the Drum of the Wild. When a Mana Burst hits it, all sheep around it become sheared. If a bucket is under a Cow, it will be filled with Milk. ",
          "items": [
            {
              "item": {
                "id": "Botania:forestDrum",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Bigger Flask",
          "longDescription": "Making Brewing Vials with Alfglass instead of Managlass gives you a stronger, somewhat larger container. This results in more drinks per Brew!",
          "items": [
            {
              "item": {
                "id": "Botania:vial",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Prismatic Shifts",
          "longDescription": "This pedastal can be passed through by both creature and Mana Bursts. You can place a Mana Lens in it, and any Mana Burst that passes through it will change to that lens\u0027s type. You can turn it off by applying a Redstone Signal.",
          "items": [
            {
              "item": {
                "id": "Botania:prism"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Otherworldly Design",
          "longDescription": "End Stone is mystrious in its own right, and a nice color. The Elves have shown us we can make some nice decorative designs with it as well.",
          "items": [
            {
              "item": {
                "id": "Botania:endStoneBrick"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:endStoneBrick",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:endStoneBrick0Stairs"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Killed Until Dead",
          "longDescription": "The Resolute Ivy can be combined with any item. When you die, this item will appear with you when you respawn. The effect only lasts once per use.",
          "items": [
            {
              "item": {
                "id": "Botania:keepIvy"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Slashing Star",
          "longDescription": "    You can upgrade the Terra Blade with some fairly useful abilities.                                        The first is called the Starcaller. Each swing has a chance of summoning a shooting star from the sky, which will fall onto the area you are aiming at. Any entity hit with it will take damage.",
          "items": [
            {
              "item": {
                "id": "Botania:starSword"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Thunder and Lightning",
          "longDescription": "    The second upgrade involves imbuing the Terra Blade with the power of the Storm.                         By sacrificing the long range attacks, instead you can cause a lightning attack to arc to multiple enemies. Each time the lightning arcs from one enemy to another, the damage it deals decreases.",
          "items": [
            {
              "item": {
                "id": "Botania:thunderSword"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 4,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 15
        }
      ]
    },
    {
      "name": "Elvish Devices",
      "description": "The wonderful, magical properties of these Elven materials has really sparked the creativity of my assistants and I, and we\u0027ve been working night and day to create new devices for you to play with. The Elves as well are quite creative, and have helped out in these designs. ",
      "x": 232,
      "y": 13,
      "icon": {
        "id": "Botania:spawnerClaw"
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "A Regular Pollock",
          "longDescription": "When colored with a Dye, Mana Spreaders equipped with this Lens can Paint blocks by shooting them with a Mana Burst. Only blocks like Wool, Carpet, etc can be painted.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 14
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Am I a Wizard?!",
          "longDescription": "This augments a Mana Pool like the Alchemist Catalyst, but allows you to double some materials at the cost of Mana. You can duplicate Redstone, Glowstone, Nether Quartz, Coal, Snowballs, Netherrack, Soul Sand, and Gravel just by throwing it into the Mana Pool.",
          "items": [
            {
              "item": {
                "id": "Botania:conjurationCatalyst"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Make My Monster Show!",
          "longDescription": "Those Monster Spawners in your world only seem to create monsters if you or an assistant are close by. With this, you can make it spawn horrible deadly creatures at all times. Why? I don\u0027t know, but you might find some use out of it.",
          "items": [
            {
              "item": {
                "id": "Botania:spawnerClaw"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Twinkle Twinkle",
          "longDescription": "Overcast sky all the time? Too much light pollution? Even the Elves have this problem. They\u0027ve come up with a solution called the Starfield Creator, which will cast a stary filled sky above you. Quite peaceful and beautiful!",
          "items": [
            {
              "item": {
                "id": "Botania:starfield"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Spin the Chamber",
          "longDescription": "Adding this to your Mana Blaster allows you to have six Mana Lenses on it instead of one. Shift + Right Click to change which slot you are on. When you add a Lens, it adds it to the slot you are currently on.",
          "items": [
            {
              "item": {
                "id": "Botania:clip"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Point of Origin",
          "longDescription": "The World Seed will teleport you back to the World Spawn (where you first appeared) if you are over 24 meters away.",
          "items": [
            {
              "item": {
                "id": "Botania:worldSeed"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Bounce Bounce",
          "longDescription": "The Warp Lens changes a Burst so that if it hits a Force Relay, it will warp to the block the Relay is bound to, maintaining Momentum and Direction. Bore Lenses will not break Force Relays or Pistons.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 18
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Creepy Egg",
          "longDescription": "    This is an odd little item. I don\u0027t know if you\u0027ll have a use for it under normal circumstances. The Elves use it for various challenges and events they hold to test themselves.                                    This Cocoon, after being placed, will eventually \u0027grow\u0027 a baby animal inside of it. Usually it\u0027ll be a farm animal, but occasionally you\u0027ll get something like a baby wolf. The Elves say that you can entice it by using an Emerald on the Cocoon while its growing...",
          "items": [
            {
              "item": {
                "id": "Botania:cocoon"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Wiggle Jiggle Squiggle",
          "longDescription": "    Slimeballs still contain a bit of the living essence of Slimes themselves. By encasing it in a magical jar of Alfglass and Elementium, it has enough life to it to react.                                       When holding the Slime in a Bottle and you enter an area where Slimes naturally spawn underground, the little bitty Slime will start bouncing around! Cute and helpful!",
          "items": [
            {
              "item": {
                "id": "Botania:slimeBottle"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Look at Me!",
          "longDescription": "    The Redirective Mana Lens can only be used in a Mana Spreader. When it fires a Burst, any other Mana Spreader it hits will turn to face the Spreader with this Lens.",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 19
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Manatechnics",
          "longDescription": "    These two Mana Lenses are more for display and fancy visuals than function.                                 The Celebratory Mana Lens causes the Burst to explode in fireworks when it hits something.          The Flare Mana Lens changes the Mana Burst into a Mana Stream, like a continuous sparkler or flare firework!",
          "items": [
            {
              "item": {
                "id": "Botania:lens",
                "damage": 20
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:lens",
                "damage": 21
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 15
        }
      ]
    },
    {
      "name": "The Best Equipment?",
      "description": "Its only logical that after making Manasteel and Terrasteel equipment, that when given an even more powerful metal, we forge it into something useful, right? Well, Bandit, thats what we did! And these armor and tools all do something different!",
      "x": 287,
      "y": 75,
      "icon": {
        "id": "Botania:elementiumChest"
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Elemental Protection",
          "longDescription": "Each piece of Elementium armor you wear increases the chance that a Pixie will spawn when you get it. This Pixie will counterattack for you. When holding the Sword, the chance is increased, and the Pixies will hit harder as well. Also, if you are wearing all four pieces of Elementium Armor, your tools take 10% less Mana, and Pixies can give you random Potion effects.",
          "items": [
            {
              "item": {
                "id": "Botania:elementiumChest"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:elementiumSword"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Tonk Tonk Tonk",
          "longDescription": "The Elementium Pick will atomize Stone, Dirt, and other simple materials, leaving precious Ores behind.",
          "items": [
            {
              "item": {
                "id": "Botania:elementiumPick"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Off With Their Head!",
          "longDescription": "The Elementium Axe is very good at decapitating enemies.",
          "items": [
            {
              "item": {
                "id": "Botania:elementiumAxe"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Dig to the Heavens",
          "longDescription": "The Elementium Shovel will not only dig Sand or Gravel, but it will destroy it, and all like it connected to the same pile.",
          "items": [
            {
              "item": {
                "id": "Botania:elementiumShovel"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "World\u0027s Fastest Shearer",
          "longDescription": "If you wield the Elementium Shears like a bow (Don\u0027t ask how we figured THIS one out...), all Sheep around you will automatically Sheer themselves.",
          "items": [
            {
              "item": {
                "id": "Botania:elementiumShears"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Bottomless Bucket",
          "longDescription": "The Extrapolated Bucket has a bottom....and it doesn\u0027t. All liquids you scoop into this Bucket will vanish, forever. ",
          "items": [
            {
              "item": {
                "id": "Botania:openBucket"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Long Arm of the Claw",
          "longDescription": "The Ring of Far Reach will extend your arm\u0027s reach by about three meters. ",
          "items": [
            {
              "item": {
                "id": "Botania:reachRing"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Bloody Fairies",
          "longDescription": "Like Elementium Armor, the Great Fairy Ring will increase the chance of a Fairy spawning when you get hit.",
          "items": [
            {
              "item": {
                "id": "Botania:pixieRing"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Crystaline Bowyer",
          "longDescription": "The Crystal Bow doesn\u0027t fire normal arrows: instead it creates them out of Mana and fires them faster than a normal bow.",
          "items": [
            {
              "item": {
                "id": "Botania:crystalBow"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Black Hole Sun",
          "longDescription": "The Black Hole Talisman is useful if you need to store a ton of a single thing on you, such as Cobblestone if you are deep in a mine. Right Click an empty Talisman on any block to set the Talisman to it. Then you can Shift + Right Click to activate the Talisman. You can keep grabbing as many of the item as you want, but the Talisman will make sure you keep only one stack of it in your inventory at all times. If you Right Click the Talisman on an inventory, it will dump its contents into it.",
          "items": [
            {
              "item": {
                "id": "Botania:blackHoleTalisman"
              },
              "precision": "FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Burning Ring of Fire",
          "longDescription": "    The Thorn Chakram can be upgraded to be a bit more powerful by imbuing it with some Pixie Dust and setting it on fire. It will then ignite any enemy it hits!",
          "items": [
            {
              "item": {
                "id": "Botania:thornChakram",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Epic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Masterwork Magic Staves",
      "description": "We revisited our research into Magic Staves and Rods since we now have access to new materials. Elvish materials give us a slew of new things to try, and we\u0027ve come up with a few new toys for you!",
      "x": 266,
      "y": 100,
      "icon": {
        "id": "Botania:gravityRod"
      },
      "prerequisites": [
        "Otherworld Materials",
        "Magic Staves"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "High On Dirt",
          "longDescription": "An upgraded Rod of the Lands, this one enables you to materialize dirt in midair! Good to save yourself from a fall. Unless you can fly, that is.",
          "items": [
            {
              "item": {
                "id": "Botania:skyDirtRod"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "The Rainbow Road",
          "longDescription": "    Freezing ice to make a path is good, but Elementium enables us to go one step further. The Rod of Bifrost creates a magical rainbow broad in the air and lasts 15 seconds, so move quickly!                  You can also enchant a piece of Alfglass by combining it with the Rod of Bifrost, to resemble the Rainbow Road, and this can further be turned into Bifrost Panes, or combined with other material to make Shimmerock and Shimmerwood! Shimmerrock can also be made into a fantastic, colorful new Mana Pool as well.                                         You do not lose the Rod making Bifrost Blocks, thankfully!",
          "items": [
            {
              "item": {
                "id": "Botania:rainbowRod"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:bifrostPerm"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:shimmerrock"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:shimmerwoodPlanks"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:pool",
                "damage": 3
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "The One Free Rod",
          "longDescription": "This Staff allows you to negate the gravity around a creature and pick them up. If you swing the Staff while carrying one, you will propel them away from you.",
          "items": [
            {
              "item": {
                "id": "Botania:gravityRod",
                "nbt": "{dist:-1.0d,ticksCooldown:0,ticksTillExpire:-5117,target:-1}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 40
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Epic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 45
        }
      ]
    },
    {
      "name": "Don\u0027t Lose Your Head Over It",
      "description": "You know, we\u0027re not even sure what to make of this. The Elves don\u0027t either, as its a strange combination of both of our research areas. It seems that you can combine a skeleton skull with a few mystical objects in the Runic Altar, and by adding a Name Tag with the name of another person written on it on an Anvil, you can get a faux head that looks just like theirs! Why don\u0027t you create one of The Ferret Business CEO: Caigan?",
      "x": 216,
      "y": 93,
      "icon": {
        "id": "minecraft:skull",
        "damage": 3
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Head Hunter",
          "longDescription": "It seems the cosmos are a bit odd in the name registry. You\u0027ll have to spell the CEO\u0027s name in lowercase : caigan. Not Caigan.",
          "items": [
            {
              "item": {
                "id": "minecraft:skull",
                "damage": 3,
                "nbt": "{SkullOwner:\"caigan\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Epic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 10
        }
      ]
    },
    {
      "name": "Augmented Life",
      "description": "Our research with the Pixie Dust has resulted in some strange creations, I have to say. They\u0027d be almost alarming if they weren\u0027t also just so dang interesting. Take these two viruses for example! No, don\u0027t worry, they only effect a single creature at a time...and only horses at that. It doesn\u0027t spread...I don\u0027t think. Infecting a horse with one of these will either make it a ghostly skeletal horse, or a undead zombie horse. Either way, it seems to make them much stronger, faster, healthier, you name it! Alternatively, we\u0027ve found a set of Augments that will be useful for those Sparks we discovered a while back. Each does something different to a Spark.",
      "x": 209,
      "y": 120,
      "icon": {
        "id": "Botania:sparkUpgrade",
        "damage": 2
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Maybe a Thunder Horse?",
          "longDescription": "Horses infected with one of the two Viruses will not take fall damage, nor will their rider.",
          "items": [
            {
              "item": {
                "id": "Botania:virus",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:virus"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Charge Augment",
          "longDescription": "Placing this Augment on a Spark will allow it to send Mana to objects you or o your assistants are carrying to Charge them.",
          "items": [
            {
              "item": {
                "id": "Botania:sparkUpgrade"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Siphon Augment",
          "longDescription": "A Spark with this Augment will draw Mana to its Pool from all other Mana Pools nearby that have an unAugmented Spark on them.",
          "items": [
            {
              "item": {
                "id": "Botania:sparkUpgrade",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Dispersal Augment",
          "longDescription": "The opposite of the Siphon Augment, this will cause the Spark to send Mana out to all other Pool\u0027s nearby with an unAugmented Spark on them.",
          "items": [
            {
              "item": {
                "id": "Botania:sparkUpgrade",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Lonely Augment",
          "longDescription": "To prevent a Mana Pool with a Spark on it from interacting with other Augmented Sparks, you can use this Augment.",
          "items": [
            {
              "item": {
                "id": "Botania:sparkUpgrade",
                "damage": 3
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "I Kind of Asked for This",
          "longDescription": "    This interesting device allows you to change the Augments on Sparks automatically.  By placing it next to Mana Pools or other things with Sparks attatched to them, the Tinkerer will connect to those Sparks.                                          You can Right Click any augment onto the Tinkerer to add it. When a Redstone Signal hits the Tinkerer, it will randomly select a connected Spark that has a different Augment than what it is holding, and switch them. ",
          "items": [
            {
              "item": {
                "id": "Botania:sparkChanger"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Great Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 15
        }
      ]
    },
    {
      "name": "A Beautiful Brew",
      "description": "Brewing potions has been a pretty standard thing here at The Business for a while. Pick me ups, resistances, and more are quite useful in this very busy place. With so many things being rearched here at the Botanical Gardens, we wanted to see if we could improve on the classic Brewing system...and I think we definitely have! These Brews are a bit more potent than their classic counterparts, letting you drink from the same flask a few times to get the same effect.",
      "x": 178,
      "y": 21,
      "icon": {
        "id": "Botania:brewery"
      },
      "prerequisites": [
        "Teacher to Student"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Brewtastic!",
          "longDescription": "After placing your Botanical Brewer, you need to bind a Mana Spreader to it and supply it with Mana to Brew anything.",
          "items": [
            {
              "item": {
                "id": "Botania:brewery"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Packed With Power",
          "longDescription": "No matter the Brew, you need a vessel to hold it. Vials are made with Managlass and hold around four doses. To start a Brew, first add a Vial by dropping it onto the Brewer or Right Clicking the Vial onto it.",
          "items": [
            {
              "item": {
                "id": "Botania:vial"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Brews to Move With",
          "longDescription": "These Brews help you move around your world better, whether its making you move faster, jump higher, or breath under water.",
          "items": [
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"speed\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"jumpBoost\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"haste\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"waterBreathing\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Brews to See By",
          "longDescription": "These Brews aid vision, whether improving yours or making you invisible.",
          "items": [
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"nightVision\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"invisibility\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Brews to Toughen Up",
          "longDescription": "These Brews make you stronger and more resistant to damage.",
          "items": [
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"resistance\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"fireResistance\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"strength\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Brews for Healthier Living",
          "longDescription": "These Brews help heal you.",
          "items": [
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"healing\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"regenWeak\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"regen\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"absorption\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"clear\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Brew of a Clear Mind",
          "longDescription": "Sharing knowledge with the Thaumaturgic research branch has lead us to discover a helpful Brew. Their more troublesome Research leads to being tainted with Warp, and enough of it can cause a loss of Sanity. This Brew helps you keep a clear and sane mind.",
          "items": [
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"warpWard\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Shifting Brews",
          "longDescription": "Overload gives you Strength, Speed, Weakness, and Hunger. Feather Feet makes you immune to falling to death. Marine Allure makes you a super Fisherman. ",
          "items": [
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"overload\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"featherFeet\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"allure\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Monsterous Brews",
          "longDescription": "Crossed Souls will heal you a bit every time you kill something. Vanity\u0027s Emptiness will prevent mobs from spawning for 128 meters radius. Crimson Shade will remove all spawning restrictions in a 64 meter radius (monsters spawning in broad daylight, etc). ",
          "items": [
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"soulCross\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"emptiness\"}"
              }
            },
            {
              "item": {
                "id": "Botania:brewVial",
                "nbt": "{brewKey:\"bloodthirst\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Scent of Power",
          "longDescription": "    These potions are fantastic for quick pick-me-ups and short term help...but sometimes you don\u0027t feel like chugging a potion every few minutes if you are doing a long project in your workshop.                 This is where our new creation comes in! Many brews can be imbued into these fancy Incense Sticks. They\u0027ll last 60 times longer this way!                                             The downsides, though, is it\u0027ll take 10 times the Mana to brew these. You also can only burn them in the Incense Plate, which has a range of about 24 blocks. Use either a Flint and Steel or a Mana Burst through a Kindle Lens to ignite the Incense Plate.",
          "items": [
            {
              "item": {
                "id": "Botania:incensePlate"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "Botania:incenseStick"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 25
        }
      ]
    },
    {
      "name": "Red String Theory",
      "description": "    Ever heard of String Theory? Some of the other research labs have talked about it in the lunch area a few times and it got us thinking of possibilities. After some research and testing, we\u0027ve come up with something we like to call Red String Theory.                                Not just Theory, really, we\u0027ve actually made string. Thats red. And works amazingly! You can create devices with it that can connect to something up to eight meters away from one of the block\u0027s faces (So, straight from any of a block\u0027s six sides). Each Red String Device connects to a different kind of block or device, and does something different, and each Device can only bind to one thing at a time.                                You can literally see the Red String connection by holdinging your Wand of the Forest! Once bound, any blocks can be placed between the two without breaking the String.",
      "x": 254,
      "y": 38,
      "icon": {
        "id": "Botania:manaResource",
        "damage": 12
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Red and Stringy",
          "items": [
            {
              "item": {
                "id": "Botania:manaResource",
                "damage": 12
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Box of String",
          "longDescription": "The Red String Container will bind to any inventory it finds. You can then insert items into the Red String Container with a Hopper or other inserting device, and the items will instead be inserted into the inventory.",
          "items": [
            {
              "item": {
                "id": "Botania:redStringContainer"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Spooling String",
          "longDescription": "The Red String Dispenser can bind to either a Dispenser or a Dropper. It acts much like the Red String Container, any item inserted into the Red String Dispenser will instead be placed in the bound block, but with the addition of a Redstone Signal on the Red String Dispenser will cause the bound block to activate.",
          "items": [
            {
              "item": {
                "id": "Botania:redStringDispenser"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Growing String",
          "longDescription": "The Red String Nutrifier can bind to any block that can be fertilized with Bonemeal. Fertilizing the Red String Nutrifier will instead fertilize the bound block.",
          "items": [
            {
              "item": {
                "id": "Botania:redStringFertilizer"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Comparing String",
          "longDescription": "The Red String Comparator can bind to anything that can be read by a Comparator, like Containers, Mana Pools, etc. Then placing a Comparator next to the Red String Comparator, facing out, it will emit a Redstone Signal at the proper strength, as if the Comparator was right next to the bound block.",
          "items": [
            {
              "item": {
                "id": "Botania:redStringComparator"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Copying String",
          "longDescription": "The Red String Spoofer can bind to any Flower and even some Mushrooms. You can then place any flower with an effect on top of the Red String Spoofer. The bound flower or mushroom will no longer function as itself, it will instead act exactly like the Flower on top of the Red String Spoofer.",
          "items": [
            {
              "item": {
                "id": "Botania:redStringRelay"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Clicking String",
          "longDescription": "    The Red String Interceptor can be bound to any complex block, like a Furnace or a machine. When you or an assistant Right Clicks that block, the Interceptor will emit a Redstone Pulse.",
          "items": [
            {
              "item": {
                "id": "Botania:redStringInterceptor"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 15
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Corporea Item Logistics",
      "description": "    Our prior research into these little bundles of life we made called Sparks intrigued some of the other Research branches here in the Business. A few of them have been working with us and the Elves to come up with something new and innovative with them.                          With the poweful nature of both Elven materials and Ender Air, instead of transporting Mana between each Spark, we are able to create a network of Sparks that can move whole items between inventories! You will need a Master Corporea Spark and a bunch of Corporea Sparks for each network, plus a way to Interface with them to make requests.",
      "x": 238,
      "y": 90,
      "icon": {
        "id": "Botania:corporeaIndex"
      },
      "prerequisites": [
        "Otherworld Materials"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Did You Make a Spark Yet?",
          "longDescription": "If you haven\u0027t, you\u0027ll need to make a bunch of them!",
          "items": [
            {
              "item": {
                "id": "Botania:spark"
              },
              "required": 3,
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Minion Spark",
          "longDescription": "Corporea Sparks can be placed on top of any inventory, similar to how Sparks are placed on top of Mana Pools. They can connect to other Corporea Sparks within 8 blocks, creating a network (if there is also a Master Corporea Spark). Each Corporea Spark has access to the inventory directly below it.",
          "items": [
            {
              "item": {
                "id": "Botania:corporeaSpark"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Master Spark",
          "longDescription": "To create a Corporea Network, you must have one Master Corporea Spark. Each Network is seperated by a color, which you can see floating around the Corporea Sparks. You can change the network a Corporea Spark is on by Right Clicking some Floral Powder onto the spark. Note that the inventory a Master Spark is on cannot have its items pulled by normal Sparks.",
          "items": [
            {
              "item": {
                "id": "Botania:corporeaSpark",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Long Funnel",
          "longDescription": "The Corporea Funnel can connect to any Corporea Network via placing a Corporea Spark atop it. By placing Item Frames on each side of the Funnel, it will pull any items placed into these Frames from the network and put them into an inventory one to two blocks below it. It will do this one item at a time, and at random between the Item Frames. You can rotate the item in the frame to have it pull multiples of that item at once. ",
          "items": [
            {
              "item": {
                "id": "Botania:corporeaFunnel"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Spark Index 343",
          "longDescription": "To pull items out of your Corporea Network, you\u0027ll need an Index. By placing this down and connecting it to a Corporea Spark Network like any other Inventory, you can stand next to it and say what you want. It will search all connected inventories and give you the item. You can preceed the request with a number to get that many, or say \"this\" to get more of the item you are holding in your hand. You can also type count (like count iron bar) to see how many are in the network.",
          "items": [
            {
              "item": {
                "id": "Botania:corporeaIndex"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Stock Check",
          "longDescription": "The Corporea Intercepter listens to your Corporea Requests, and will output a Redstone Signal if a request is not fulfilled. To do this, it must have at least one Item Frame with an item on the Intercepter, and if a request for said item cannot be completed, it will emit the Redstone Signal. This can be used to activate machines or other things.",
          "items": [
            {
              "item": {
                "id": "Botania:corporeaInterceptor"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Visuality",
          "longDescription": "The Corporea Crystal Cube allows you to easily see the amount of an item in your Network. Place it down and attach it to a network with a Corporea Spark. Right Click any block or item onto the Spark to have it track that item. You can then Left Click to request 1 of that item, or Sneak + Left Click to request an entire stack.",
          "items": [
            {
              "item": {
                "id": "Botania:corporeaCrystalCube"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Memory",
          "longDescription": "    Placing the Retainer next to an Interceptor enables to to remember the last request sent to the network, and repeat it if a Redstone Signal hits it.                      This is especially useful for Automation purposes, as crafting can be activated by the Interceptor, then the request repeated after it is done.",
          "items": [
            {
              "item": {
                "id": "Botania:corporeaRetainer"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 35
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 25
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 35
        }
      ]
    },
    {
      "name": "A Thaumic Visitor!",
      "description": "    Hello? Hi! I\u0027m pretty sure you remember me, I\u0027m Wiggles, Wizard Watson\u0027s familiar. I\u0027ve been helping him guide you on your path to becoming a great Thaumaturge (and I hope you listened to me rambling about my own knowledge of Auras...).                                        But right now, he\u0027s sent me here to the Botanical Garden to assist you in a bit of cross-lab discoveries! See, my Master isn\u0027t like most wizards, he approves of knowing and understanding ALL schools of magic! Other old wizards consider it Forbidden for a Thaumaturge to approve of other Magic, but I think they are silly!           I uh... um... don\u0027t let my Master know I was talking about the others. He doesn\u0027t want me to get in trouble with them....                           Where was I... Oh yes! If you open your Thauminomicon, low on the left side is a tab called Apocryphia, which is a fancy term for Forbidden Magic (at least, I think it is...) You\u0027ll find all the Researches there!",
      "x": 262,
      "y": 69,
      "icon": {
        "id": "Botania:specialFlower",
        "nbt": "{type:\"tainthistle\"}"
      },
      "prerequisites": [
        "{Crystals and Essences}[The Power of Infusion]",
        "Otherworld Materials"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "A Living Wand Core",
          "longDescription": "    Livingwood is magical stuff, so it only makes sense it should make a decent Wand Core! You\u0027ll have to put the Rod into a Mana Pool to revitalize it, keep in mind.                   A Thaumic Wand created with Livingwood will transform Botanical Mana into Thaumic Vis, drawing it from any Mana storage device on you.",
          "items": [
            {
              "item": {
                "id": "ForbiddenMagic:WandCores",
                "damage": 7
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Magic Metal Cap",
          "longDescription": "    Manasteel is infused with a lot of magic, and you can shape it into Manasteel Caps. Like Livingwood Rods, you\u0027ll need to put it into a Mana Pool to revitalize its power.        When using it in a Wand, it provides a better Vis usage rate, and if made with a Core that transforms Botanical Mana, it will make the conversion more efficient.",
          "items": [
            {
              "item": {
                "id": "ForbiddenMagic:WandCaps",
                "damage": 3
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Arcane Whispers",
          "longDescription": "    When provided with Botanical Mana, the Whisperweed will whisper bits of arcane Knowledge to you when you are nearby.                      The whispers, after a while, might have a bit of a side effect though.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"whisperweed\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Wisps of Power",
          "longDescription": "    The Euclidaisy, when provided Botanical Mana, will pull Ethereal Essences from the void, which can help provide you much needed Essentia.                                        A Redstone Signal will disable the flower.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"euclidaisy\"}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Taint Cleansing",
          "longDescription": "    The Tainthistle is definitely a Thaumaturge\u0027s friend. If your Alchemical or Infusion efforts produce Flux Goo, the Tainthistle will absorb it, turning it into Mana.",
          "items": [
            {
              "item": {
                "id": "Botania:specialFlower",
                "nbt": "{type:\"tainthistle\"}"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 20
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 20
        }
      ]
    },
    {
      "name": "Thaumic Dreams",
      "description": "    Hi, it\u0027s Wiggles again! The world of the Elves, Alfheim, seems to be steeped with all sorts of magic. All the materials you trade for? Those would make excellent Wand pieces, I think!",
      "x": 278,
      "y": 44,
      "icon": {
        "id": "ForbiddenMagic:WandCaps",
        "damage": 5
      },
      "prerequisites": [
        "Battle of Gaia",
        "A Thaumic Visitor!"
      ],
      "trigger": "ANTI_TRIGGER",
      "tasks": [
        {
          "type": "DETECT",
          "description": "Dream Big",
          "longDescription": "    Dreamwood is infused with more than enough magic to turn it into a Staff. Like Livingwood, it will need to be put into a Mana Pool to awaken it.                                                 Staves made of Dreamwood store a lot more Vis, and boost the power of any Foci used with it.",
          "items": [
            {
              "item": {
                "id": "ForbiddenMagic:WandCores",
                "damage": 11
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "ForbiddenMagic:WandCores",
                "damage": 13
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Pink and Pretty",
          "longDescription": "    Elementium makes fantastic Wand Caps, but require a bit more than just a dip in a Mana Pool to wake them up. You\u0027ll need to Infuse some Runes and a Gaia Spirit to properly use it as a Wand Cap.                        Elementium Wand Caps are fantastic at channeling Vis, and when combined with a Wand Core that converts Botanical Mana, reduces the cost greatly.",
          "items": [
            {
              "item": {
                "id": "ForbiddenMagic:WandCaps",
                "damage": 5
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 2
        },
        {
          "id": "HardcoreQuesting:bags",
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        }
      ],
      "rewardchoice": [
        {
          "id": "ferretshinies:NullToken",
          "amount": 30
        },
        {
          "id": "HardcoreQuesting:bags",
          "amount": 3,
          "nbt": "{RepairCost:2,display:{Name:\"Basic Blind Bag of Blind Bags\"}}"
        },
        {
          "id": "HardcoreQuesting:bags",
          "damage": 1,
          "amount": 2,
          "nbt": "{RepairCost:2,display:{Name:\"Good Blind Bag of Blind Bags\"}}"
        }
      ],
      "commandrewards": [],
      "reputationrewards": [
        {
          "reputation": 0,
          "value": 30
        }
      ]
    }
  ],
  "reputationBar": []
}